const mavka = getMavka();
const context = getContext();

context.set("телеграм_бот_отримати_список_оновлень", mavka.tools.asyncFn(async ([token, lastUpdateId]) => {
  const response = await fetch(`https://api.telegram.org/bot${token}/getUpdates`, {
    method: "post",
    body: JSON.stringify({
      offset: lastUpdateId ? lastUpdateId + 1 : null
    }),
    headers: {
      "Accept": "application/json",
      "Content-Type": "application/json"
    }
  });
  const data = await response.json();
  const { result } = data;

  return mavka.toCell(result);
}));

context.set("телеграм_бот_надіслати_запит", mavka.tools.asyncFn(async ([token, method, params]) => {
  const response = await fetch(`https://api.telegram.org/bot${token}/${method}`, {
    method: "post",
    body: JSON.stringify(params),
    headers: {
      "Accept": "application/json",
      "Content-Type": "application/json"
    }
  });
  const data = await response.json();
  const { result } = data;

  return mavka.toCell(result);
}));

const typesModuleCode = `
структура Оновлення
  ідентифікатор_оновлення число
  повідомлення Повідомлення
  відредаговане_повідомлення Повідомлення
  повідомлення_каналу Повідомлення
  відредаговане_повідомлення_каналу Повідомлення
  інлайн_запит ВбудованийЗапит
  вибраний_результат_інлайну ВибранийРезультатПошукуПозастроками
  запит_зворотного_виклику ЗапитЗворотньогоВиклику
  запит_на_доставку ЗапитДоставки
  запит_перед_оформленням ЗапитНапередВідшкодування
  опитування Опитування
  відповідь_на_опитування ВідповідьОпитування
  мій_учасник_чату УчасникаЧатуОновлено
  учасник_чату УчасникаЧатуОновлено
  запит_на_приєднання_до_чату ЗапитНаПриєднанняДоЧату
кінець

Оновлення.створити_з_телеграм_об'єкта = (то): то ? Оновлення(
  ідентифікатор_оновлення=то.update_id,
  повідомлення=Повідомлення.створити_з_телеграм_об'єкта(то.message),
  відредаговане_повідомлення=Повідомлення.створити_з_телеграм_об'єкта(то.edited_message),
  повідомлення_каналу=Повідомлення.створити_з_телеграм_об'єкта(то.channel_post),
  відредаговане_повідомлення_каналу=Повідомлення.створити_з_телеграм_об'єкта(то.edited_channel_post),
  інлайн_запит=ВбудованийЗапит.створити_з_телеграм_об'єкта(то.inline_query),
  вибраний_результат_інлайну=ВибранийРезультатПошукуПозастроками.створити_з_телеграм_об'єкта(то.chosen_inline_result),
  запит_зворотного_виклику=ЗапитЗворотньогоВиклику.створити_з_телеграм_об'єкта(то.callback_query),
  запит_на_доставку=ЗапитДоставки.створити_з_телеграм_об'єкта(то.shipping_query),
  запит_перед_оформленням=ЗапитНапередВідшкодування.створити_з_телеграм_об'єкта(то.pre_checkout_query),
  опитування=Опитування.створити_з_телеграм_об'єкта(то.poll),
  відповідь_на_опитування=ВідповідьОпитування.створити_з_телеграм_об'єкта(то.poll_answer),
  мій_учасник_чату=УчасникаЧатуОновлено.створити_з_телеграм_об'єкта(то.my_chat_member),
  учасник_чату=УчасникаЧатуОновлено.створити_з_телеграм_об'єкта(то.chat_member),
  запит_на_приєднання_до_чату=ЗапитНаПриєднанняДоЧату.створити_з_телеграм_об'єкта(то.chat_join_request)
) : пусто

дія Оновлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    update_id=я.ідентифікатор_оновлення,
    message=я.повідомлення,
    edited_message=я.відредаговане_повідомлення,
    channel_post=я.повідомлення_каналу,
    edited_channel_post=я.відредаговане_повідомлення_каналу,
    inline_query=я.інлайн_запит,
    chosen_inline_result=я.вибраний_результат_інлайну,
    callback_query=я.запит_зворотного_виклику,
    shipping_query=я.запит_на_доставку,
    pre_checkout_query=я.запит_перед_оформленням,
    poll=я.опитування,
    poll_answer=я.відповідь_на_опитування,
    my_chat_member=я.мій_учасник_чату,
    chat_member=я.учасник_чату,
    chat_join_request=я.запит_на_приєднання_до_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ІнформаціяПроВебгук
  урл текст
  має_власний_сертифікат логічне
  кількість_оновлень_в_очікуванні число
  інтернет_адреса текст
  дата_останньої_помилки число
  остання_повідомлення_про_помилку текст
  дата_останньої_помилки_синхронізації число
  максимальна_кількість_з'єднань число
  дозволені_оновлення Список
кінець

ІнформаціяПроВебгук.створити_з_телеграм_об'єкта = (то): то ? ІнформаціяПроВебгук(
  урл=то.url,
  має_власний_сертифікат=то.has_custom_certificate,
  кількість_оновлень_в_очікуванні=то.pending_update_count,
  інтернет_адреса=то.ip_address,
  дата_останньої_помилки=то.last_error_date,
  остання_повідомлення_про_помилку=то.last_error_message,
  дата_останньої_помилки_синхронізації=то.last_synchronization_error_date,
  максимальна_кількість_з'єднань=то.max_connections,
  дозволені_оновлення=то.allowed_updates
) : пусто

дія ІнформаціяПроВебгук.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    url=я.урл,
    has_custom_certificate=я.має_власний_сертифікат,
    pending_update_count=я.кількість_оновлень_в_очікуванні,
    ip_address=я.інтернет_адреса,
    last_error_date=я.дата_останньої_помилки,
    last_error_message=я.остання_повідомлення_про_помилку,
    last_synchronization_error_date=я.дата_останньої_помилки_синхронізації,
    max_connections=я.максимальна_кількість_з'єднань,
    allowed_updates=я.дозволені_оновлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Користувач
  ідентифікатор число
  є_ботом логічне
  ім'я текст
  прізвище текст
  ім'я_користувача текст
  код_мови текст
  є_преміум логічне
  додано_в_меню_вкладень логічне
  може_приєднуватись_до_груп логічне
  може_читати_всі_повідомлення_групи логічне
  підтримує_інлайн_запити логічне
кінець

Користувач.створити_з_телеграм_об'єкта = (то): то ? Користувач(
  ідентифікатор=то.id,
  є_ботом=то.is_bot,
  ім'я=то.first_name,
  прізвище=то.last_name,
  ім'я_користувача=то.username,
  код_мови=то.language_code,
  є_преміум=то.is_premium,
  додано_в_меню_вкладень=то.added_to_attachment_menu,
  може_приєднуватись_до_груп=то.can_join_groups,
  може_читати_всі_повідомлення_групи=то.can_read_all_group_messages,
  підтримує_інлайн_запити=то.supports_inline_queries
) : пусто

дія Користувач.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    id=я.ідентифікатор,
    is_bot=я.є_ботом,
    first_name=я.ім'я,
    last_name=я.прізвище,
    username=я.ім'я_користувача,
    language_code=я.код_мови,
    is_premium=я.є_преміум,
    added_to_attachment_menu=я.додано_в_меню_вкладень,
    can_join_groups=я.може_приєднуватись_до_груп,
    can_read_all_group_messages=я.може_читати_всі_повідомлення_групи,
    supports_inline_queries=я.підтримує_інлайн_запити,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Чат
  ідентифікатор число
  тип текст
  назва текст
  ім'я_користувача текст
  ім'я текст
  прізвище текст
  є_форумом логічне
  фото ФотоЧату
  активні_імена_користувачів Список
  ідентифікатор_призначеного_емодзі текст
  біографія текст
  має_приватні_пересилання логічне
  має_обмеження_на_голосові_та_відеоповідомлення логічне
  приєднуйтесь_щоб_надсилати_повідомлення логічне
  приєднання_за_запитом логічне
  опис текст
  посилання_запрошення текст
  закріплене_повідомлення Повідомлення
  дозволи ДозволиЧату
  затримка_у_повільному_режимі число
  час_автоматичного_видалення_повідомлення число
  ввімкнено_агресивний_антиспам логічне
  є_приховані_учасники логічне
  має_захищений_контент логічне
  назва_набору_стікерів текст
  може_встановлювати_набір_стікерів логічне
  ідентифікатор_пов'язаного_чату число
  розташування МісцезнаходженняЧату
кінець

Чат.створити_з_телеграм_об'єкта = (то): то ? Чат(
  ідентифікатор=то.id,
  тип=то.type,
  назва=то.title,
  ім'я_користувача=то.username,
  ім'я=то.first_name,
  прізвище=то.last_name,
  є_форумом=то.is_forum,
  фото=ФотоЧату.створити_з_телеграм_об'єкта(то.photo),
  активні_імена_користувачів=то.active_usernames,
  ідентифікатор_призначеного_емодзі=то.emoji_status_custom_emoji_id,
  біографія=то.bio,
  має_приватні_пересилання=то.has_private_forwards,
  має_обмеження_на_голосові_та_відеоповідомлення=то.has_restricted_voice_and_video_messages,
  приєднуйтесь_щоб_надсилати_повідомлення=то.join_to_send_messages,
  приєднання_за_запитом=то.join_by_request,
  опис=то.description,
  посилання_запрошення=то.invite_link,
  закріплене_повідомлення=Повідомлення.створити_з_телеграм_об'єкта(то.pinned_message),
  дозволи=ДозволиЧату.створити_з_телеграм_об'єкта(то.permissions),
  затримка_у_повільному_режимі=то.slow_mode_delay,
  час_автоматичного_видалення_повідомлення=то.message_auto_delete_time,
  ввімкнено_агресивний_антиспам=то.has_aggressive_anti_spam_enabled,
  є_приховані_учасники=то.has_hidden_members,
  має_захищений_контент=то.has_protected_content,
  назва_набору_стікерів=то.sticker_set_name,
  може_встановлювати_набір_стікерів=то.can_set_sticker_set,
  ідентифікатор_пов'язаного_чату=то.linked_chat_id,
  розташування=МісцезнаходженняЧату.створити_з_телеграм_об'єкта(то.location)
) : пусто

дія Чат.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    id=я.ідентифікатор,
    type=я.тип,
    title=я.назва,
    username=я.ім'я_користувача,
    first_name=я.ім'я,
    last_name=я.прізвище,
    is_forum=я.є_форумом,
    photo=я.фото,
    active_usernames=я.активні_імена_користувачів,
    emoji_status_custom_emoji_id=я.ідентифікатор_призначеного_емодзі,
    bio=я.біографія,
    has_private_forwards=я.має_приватні_пересилання,
    has_restricted_voice_and_video_messages=я.має_обмеження_на_голосові_та_відеоповідомлення,
    join_to_send_messages=я.приєднуйтесь_щоб_надсилати_повідомлення,
    join_by_request=я.приєднання_за_запитом,
    description=я.опис,
    invite_link=я.посилання_запрошення,
    pinned_message=я.закріплене_повідомлення,
    permissions=я.дозволи,
    slow_mode_delay=я.затримка_у_повільному_режимі,
    message_auto_delete_time=я.час_автоматичного_видалення_повідомлення,
    has_aggressive_anti_spam_enabled=я.ввімкнено_агресивний_антиспам,
    has_hidden_members=я.є_приховані_учасники,
    has_protected_content=я.має_захищений_контент,
    sticker_set_name=я.назва_набору_стікерів,
    can_set_sticker_set=я.може_встановлювати_набір_стікерів,
    linked_chat_id=я.ідентифікатор_пов'язаного_чату,
    location=я.розташування,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Повідомлення
  ідентифікатор_повідомлення число
  ідентифікатор_теми_повідомлення число
  від Користувач
  чат_відправника Чат
  дата число
  чат Чат
  відправник_переслання Користувач
  чат_відправника_переслання Чат
  ідентифікатор_повідомлення_відправника_переслання число
  підпис_відправника_переслання текст
  ім'я_відправника_переслання текст
  дата_переслання число
  є_темою_повідомлення логічне
  автоматичне_переслання логічне
  відповідь_на_повідомлення Повідомлення
  через_бота Користувач
  дата_редагування число
  має_захищений_контент логічне
  ідентифікатор_медіагрупи текст
  підпис_автора текст
  текст текст
  сутності Список
  анімація Анімація
  аудіо Аудіо
  документ Документ
  фото Список
  стікер Стікер
  відео Відео
  відео_замітка ВідеоНотатка
  голос Голос
  підпис текст
  сутності_підпису Список
  є_спойлер_медіа логічне
  контакт Контакт
  кубик Кубик
  гра Гра
  опитування Опитування
  місце_зустрічі МісцеЗустрічі
  розташування Місцезнаходження
  нові_учасники_чату Список
  покинув_чат_учасник Користувач
  нова_назва_чату текст
  нове_фото_чату Список
  видалено_фото_чату логічне
  створено_груповий_чат логічне
  створено_супергруповий_чат логічне
  створено_канал_чату логічне
  змінено_таймер_авто_видалення_повідомлень ЗмінаТаймераАвтоВидаленняПовідомлення
  перенесено_до_ідентифікатора_чату число
  перенесено_з_ідентифікатора_чату число
  закріплене_повідомлення Повідомлення
  рахунок Рахунок
  успішна_оплата УспішнаОплата
  користувач_поділився КористувачаПоширено
  чат_поділився ЧатПоширено
  підключений_вебсайт текст
  дозволений_доступ_на_запис ДоступНаПисьмоДозволений
  паспортні_дані ДаніПаспорта
  спрацювала_близькість_сповіщень СпрацюванняБлизькості
  створена_тема_форуму ТемуФорумуСтворено
  відредагована_тема_форуму ТемуФорумуВідредаговано
  закрита_тема_форуму ТемаФорумуЗакрита
  відкрита_тема_форуму_знову ТемаФорумуВідкрита
  прихована_загальна_тема_форуму ЗагальнаТемаФорумуПрихована
  розкрита_загальна_тема_форуму ЗагальнаТемаФорумуВідкрита
  заплановано_відеочат ВідеоЧатЗаплановано
  розпочато_відеочат ВідеоЧатРозпочато
  завершено_відеочат ВідеоЧатЗавершено
  учасники_відеочату_запрошені ЗапрошенняУчасниківВідеоЧату
  дані_вебдодатку ДаніВебДодатку
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

Повідомлення.створити_з_телеграм_об'єкта = (то): то ? Повідомлення(
  ідентифікатор_повідомлення=то.message_id,
  ідентифікатор_теми_повідомлення=то.message_thread_id,
  від=Користувач.створити_з_телеграм_об'єкта(то.from),
  чат_відправника=Чат.створити_з_телеграм_об'єкта(то.sender_chat),
  дата=то.date,
  чат=Чат.створити_з_телеграм_об'єкта(то.chat),
  відправник_переслання=Користувач.створити_з_телеграм_об'єкта(то.forward_from),
  чат_відправника_переслання=Чат.створити_з_телеграм_об'єкта(то.forward_from_chat),
  ідентифікатор_повідомлення_відправника_переслання=то.forward_from_message_id,
  підпис_відправника_переслання=то.forward_signature,
  ім'я_відправника_переслання=то.forward_sender_name,
  дата_переслання=то.forward_date,
  є_темою_повідомлення=то.is_topic_message,
  автоматичне_переслання=то.is_automatic_forward,
  відповідь_на_повідомлення=Повідомлення.створити_з_телеграм_об'єкта(то.reply_to_message),
  через_бота=Користувач.створити_з_телеграм_об'єкта(то.via_bot),
  дата_редагування=то.edit_date,
  має_захищений_контент=то.has_protected_content,
  ідентифікатор_медіагрупи=то.media_group_id,
  підпис_автора=то.author_signature,
  текст=то.text,
  сутності=то.entities,
  анімація=Анімація.створити_з_телеграм_об'єкта(то.animation),
  аудіо=Аудіо.створити_з_телеграм_об'єкта(то.audio),
  документ=Документ.створити_з_телеграм_об'єкта(то.document),
  фото=то.photo,
  стікер=Стікер.створити_з_телеграм_об'єкта(то.sticker),
  відео=Відео.створити_з_телеграм_об'єкта(то.video),
  відео_замітка=ВідеоНотатка.створити_з_телеграм_об'єкта(то.video_note),
  голос=Голос.створити_з_телеграм_об'єкта(то.voice),
  підпис=то.caption,
  сутності_підпису=то.caption_entities,
  є_спойлер_медіа=то.has_media_spoiler,
  контакт=Контакт.створити_з_телеграм_об'єкта(то.contact),
  кубик=Кубик.створити_з_телеграм_об'єкта(то.dice),
  гра=Гра.створити_з_телеграм_об'єкта(то.game),
  опитування=Опитування.створити_з_телеграм_об'єкта(то.poll),
  місце_зустрічі=МісцеЗустрічі.створити_з_телеграм_об'єкта(то.venue),
  розташування=Місцезнаходження.створити_з_телеграм_об'єкта(то.location),
  нові_учасники_чату=то.new_chat_members,
  покинув_чат_учасник=Користувач.створити_з_телеграм_об'єкта(то.left_chat_member),
  нова_назва_чату=то.new_chat_title,
  нове_фото_чату=то.new_chat_photo,
  видалено_фото_чату=то.delete_chat_photo,
  створено_груповий_чат=то.group_chat_created,
  створено_супергруповий_чат=то.supergroup_chat_created,
  створено_канал_чату=то.channel_chat_created,
  змінено_таймер_авто_видалення_повідомлень=ЗмінаТаймераАвтоВидаленняПовідомлення.створити_з_телеграм_об'єкта(то.message_auto_delete_timer_changed),
  перенесено_до_ідентифікатора_чату=то.migrate_to_chat_id,
  перенесено_з_ідентифікатора_чату=то.migrate_from_chat_id,
  закріплене_повідомлення=Повідомлення.створити_з_телеграм_об'єкта(то.pinned_message),
  рахунок=Рахунок.створити_з_телеграм_об'єкта(то.invoice),
  успішна_оплата=УспішнаОплата.створити_з_телеграм_об'єкта(то.successful_payment),
  користувач_поділився=КористувачаПоширено.створити_з_телеграм_об'єкта(то.user_shared),
  чат_поділився=ЧатПоширено.створити_з_телеграм_об'єкта(то.chat_shared),
  підключений_вебсайт=то.connected_website,
  дозволений_доступ_на_запис=ДоступНаПисьмоДозволений.створити_з_телеграм_об'єкта(то.write_access_allowed),
  паспортні_дані=ДаніПаспорта.створити_з_телеграм_об'єкта(то.passport_data),
  спрацювала_близькість_сповіщень=СпрацюванняБлизькості.створити_з_телеграм_об'єкта(то.proximity_alert_triggered),
  створена_тема_форуму=ТемуФорумуСтворено.створити_з_телеграм_об'єкта(то.forum_topic_created),
  відредагована_тема_форуму=ТемуФорумуВідредаговано.створити_з_телеграм_об'єкта(то.forum_topic_edited),
  закрита_тема_форуму=ТемаФорумуЗакрита.створити_з_телеграм_об'єкта(то.forum_topic_closed),
  відкрита_тема_форуму_знову=ТемаФорумуВідкрита.створити_з_телеграм_об'єкта(то.forum_topic_reopened),
  прихована_загальна_тема_форуму=ЗагальнаТемаФорумуПрихована.створити_з_телеграм_об'єкта(то.general_forum_topic_hidden),
  розкрита_загальна_тема_форуму=ЗагальнаТемаФорумуВідкрита.створити_з_телеграм_об'єкта(то.general_forum_topic_unhidden),
  заплановано_відеочат=ВідеоЧатЗаплановано.створити_з_телеграм_об'єкта(то.video_chat_scheduled),
  розпочато_відеочат=ВідеоЧатРозпочато.створити_з_телеграм_об'єкта(то.video_chat_started),
  завершено_відеочат=ВідеоЧатЗавершено.створити_з_телеграм_об'єкта(то.video_chat_ended),
  учасники_відеочату_запрошені=ЗапрошенняУчасниківВідеоЧату.створити_з_телеграм_об'єкта(то.video_chat_participants_invited),
  дані_вебдодатку=ДаніВебДодатку.створити_з_телеграм_об'єкта(то.web_app_data),
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup)
) : пусто

дія Повідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    message_id=я.ідентифікатор_повідомлення,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    from=я.від,
    sender_chat=я.чат_відправника,
    date=я.дата,
    chat=я.чат,
    forward_from=я.відправник_переслання,
    forward_from_chat=я.чат_відправника_переслання,
    forward_from_message_id=я.ідентифікатор_повідомлення_відправника_переслання,
    forward_signature=я.підпис_відправника_переслання,
    forward_sender_name=я.ім'я_відправника_переслання,
    forward_date=я.дата_переслання,
    is_topic_message=я.є_темою_повідомлення,
    is_automatic_forward=я.автоматичне_переслання,
    reply_to_message=я.відповідь_на_повідомлення,
    via_bot=я.через_бота,
    edit_date=я.дата_редагування,
    has_protected_content=я.має_захищений_контент,
    media_group_id=я.ідентифікатор_медіагрупи,
    author_signature=я.підпис_автора,
    text=я.текст,
    entities=я.сутності,
    animation=я.анімація,
    audio=я.аудіо,
    document=я.документ,
    photo=я.фото,
    sticker=я.стікер,
    video=я.відео,
    video_note=я.відео_замітка,
    voice=я.голос,
    caption=я.підпис,
    caption_entities=я.сутності_підпису,
    has_media_spoiler=я.є_спойлер_медіа,
    contact=я.контакт,
    dice=я.кубик,
    game=я.гра,
    poll=я.опитування,
    venue=я.місце_зустрічі,
    location=я.розташування,
    new_chat_members=я.нові_учасники_чату,
    left_chat_member=я.покинув_чат_учасник,
    new_chat_title=я.нова_назва_чату,
    new_chat_photo=я.нове_фото_чату,
    delete_chat_photo=я.видалено_фото_чату,
    group_chat_created=я.створено_груповий_чат,
    supergroup_chat_created=я.створено_супергруповий_чат,
    channel_chat_created=я.створено_канал_чату,
    message_auto_delete_timer_changed=я.змінено_таймер_авто_видалення_повідомлень,
    migrate_to_chat_id=я.перенесено_до_ідентифікатора_чату,
    migrate_from_chat_id=я.перенесено_з_ідентифікатора_чату,
    pinned_message=я.закріплене_повідомлення,
    invoice=я.рахунок,
    successful_payment=я.успішна_оплата,
    user_shared=я.користувач_поділився,
    chat_shared=я.чат_поділився,
    connected_website=я.підключений_вебсайт,
    write_access_allowed=я.дозволений_доступ_на_запис,
    passport_data=я.паспортні_дані,
    proximity_alert_triggered=я.спрацювала_близькість_сповіщень,
    forum_topic_created=я.створена_тема_форуму,
    forum_topic_edited=я.відредагована_тема_форуму,
    forum_topic_closed=я.закрита_тема_форуму,
    forum_topic_reopened=я.відкрита_тема_форуму_знову,
    general_forum_topic_hidden=я.прихована_загальна_тема_форуму,
    general_forum_topic_unhidden=я.розкрита_загальна_тема_форуму,
    video_chat_scheduled=я.заплановано_відеочат,
    video_chat_started=я.розпочато_відеочат,
    video_chat_ended=я.завершено_відеочат,
    video_chat_participants_invited=я.учасники_відеочату_запрошені,
    web_app_data=я.дані_вебдодатку,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ІдПовідомлення
  ідентифікатор_повідомлення число
кінець

ІдПовідомлення.створити_з_телеграм_об'єкта = (то): то ? ІдПовідомлення(
  ідентифікатор_повідомлення=то.message_id
) : пусто

дія ІдПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    message_id=я.ідентифікатор_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура СутністьПовідомлення
  тип текст
  зсув число
  довжина число
  урл текст
  користувач Користувач
  мова текст
  ідентифікатор_спеціального_емодзі текст
кінець

СутністьПовідомлення.створити_з_телеграм_об'єкта = (то): то ? СутністьПовідомлення(
  тип=то.type,
  зсув=то.offset,
  довжина=то.length,
  урл=то.url,
  користувач=Користувач.створити_з_телеграм_об'єкта(то.user),
  мова=то.language,
  ідентифікатор_спеціального_емодзі=то.custom_emoji_id
) : пусто

дія СутністьПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    offset=я.зсув,
    length=я.довжина,
    url=я.урл,
    user=я.користувач,
    language=я.мова,
    custom_emoji_id=я.ідентифікатор_спеціального_емодзі,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РозмірФото
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  ширина число
  висота число
  розмір_файлу число
кінець

РозмірФото.створити_з_телеграм_об'єкта = (то): то ? РозмірФото(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  ширина=то.width,
  висота=то.height,
  розмір_файлу=то.file_size
) : пусто

дія РозмірФото.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    width=я.ширина,
    height=я.висота,
    file_size=я.розмір_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Анімація
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  ширина число
  висота число
  тривалість число
  мініатюра РозмірФото
  ім'я_файлу текст
  мімтип текст
  розмір_файлу число
кінець

Анімація.створити_з_телеграм_об'єкта = (то): то ? Анімація(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  ширина=то.width,
  висота=то.height,
  тривалість=то.duration,
  мініатюра=РозмірФото.створити_з_телеграм_об'єкта(то.thumb),
  ім'я_файлу=то.file_name,
  мімтип=то.mime_type,
  розмір_файлу=то.file_size
) : пусто

дія Анімація.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    width=я.ширина,
    height=я.висота,
    duration=я.тривалість,
    thumb=я.мініатюра,
    file_name=я.ім'я_файлу,
    mime_type=я.мімтип,
    file_size=я.розмір_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Аудіо
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  тривалість число
  виконавець текст
  назва текст
  ім'я_файлу текст
  мімтип текст
  розмір_файлу число
  мініатюра РозмірФото
кінець

Аудіо.створити_з_телеграм_об'єкта = (то): то ? Аудіо(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  тривалість=то.duration,
  виконавець=то.performer,
  назва=то.title,
  ім'я_файлу=то.file_name,
  мімтип=то.mime_type,
  розмір_файлу=то.file_size,
  мініатюра=РозмірФото.створити_з_телеграм_об'єкта(то.thumb)
) : пусто

дія Аудіо.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    duration=я.тривалість,
    performer=я.виконавець,
    title=я.назва,
    file_name=я.ім'я_файлу,
    mime_type=я.мімтип,
    file_size=я.розмір_файлу,
    thumb=я.мініатюра,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Документ
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  мініатюра РозмірФото
  ім'я_файлу текст
  мімтип текст
  розмір_файлу число
кінець

Документ.створити_з_телеграм_об'єкта = (то): то ? Документ(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  мініатюра=РозмірФото.створити_з_телеграм_об'єкта(то.thumb),
  ім'я_файлу=то.file_name,
  мімтип=то.mime_type,
  розмір_файлу=то.file_size
) : пусто

дія Документ.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    thumb=я.мініатюра,
    file_name=я.ім'я_файлу,
    mime_type=я.мімтип,
    file_size=я.розмір_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Відео
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  ширина число
  висота число
  тривалість число
  мініатюра РозмірФото
  ім'я_файлу текст
  мімтип текст
  розмір_файлу число
кінець

Відео.створити_з_телеграм_об'єкта = (то): то ? Відео(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  ширина=то.width,
  висота=то.height,
  тривалість=то.duration,
  мініатюра=РозмірФото.створити_з_телеграм_об'єкта(то.thumb),
  ім'я_файлу=то.file_name,
  мімтип=то.mime_type,
  розмір_файлу=то.file_size
) : пусто

дія Відео.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    width=я.ширина,
    height=я.висота,
    duration=я.тривалість,
    thumb=я.мініатюра,
    file_name=я.ім'я_файлу,
    mime_type=я.мімтип,
    file_size=я.розмір_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідеоНотатка
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  довжина число
  тривалість число
  мініатюра РозмірФото
  розмір_файлу число
кінець

ВідеоНотатка.створити_з_телеграм_об'єкта = (то): то ? ВідеоНотатка(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  довжина=то.length,
  тривалість=то.duration,
  мініатюра=РозмірФото.створити_з_телеграм_об'єкта(то.thumb),
  розмір_файлу=то.file_size
) : пусто

дія ВідеоНотатка.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    length=я.довжина,
    duration=я.тривалість,
    thumb=я.мініатюра,
    file_size=я.розмір_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Голос
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  тривалість число
  мімтип текст
  розмір_файлу число
кінець

Голос.створити_з_телеграм_об'єкта = (то): то ? Голос(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  тривалість=то.duration,
  мімтип=то.mime_type,
  розмір_файлу=то.file_size
) : пусто

дія Голос.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    duration=я.тривалість,
    mime_type=я.мімтип,
    file_size=я.розмір_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Контакт
  номер_телефону текст
  ім'я текст
  прізвище текст
  ідентифікатор_користувача число
  візитна_картка текст
кінець

Контакт.створити_з_телеграм_об'єкта = (то): то ? Контакт(
  номер_телефону=то.phone_number,
  ім'я=то.first_name,
  прізвище=то.last_name,
  ідентифікатор_користувача=то.user_id,
  візитна_картка=то.vcard
) : пусто

дія Контакт.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    phone_number=я.номер_телефону,
    first_name=я.ім'я,
    last_name=я.прізвище,
    user_id=я.ідентифікатор_користувача,
    vcard=я.візитна_картка,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Кубик
  емодзі текст
  значення число
кінець

Кубик.створити_з_телеграм_об'єкта = (то): то ? Кубик(
  емодзі=то.emoji,
  значення=то.value
) : пусто

дія Кубик.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    emoji=я.емодзі,
    value=я.значення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОпціяОпитування
  текст текст
  кількість_голосуючих число
кінець

ОпціяОпитування.створити_з_телеграм_об'єкта = (то): то ? ОпціяОпитування(
  текст=то.text,
  кількість_голосуючих=то.voter_count
) : пусто

дія ОпціяОпитування.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    text=я.текст,
    voter_count=я.кількість_голосуючих,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідповідьОпитування
  ідентифікатор_опитування текст
  користувач Користувач
  ідентифікатори_варіантів_відповідей Список
кінець

ВідповідьОпитування.створити_з_телеграм_об'єкта = (то): то ? ВідповідьОпитування(
  ідентифікатор_опитування=то.poll_id,
  користувач=Користувач.створити_з_телеграм_об'єкта(то.user),
  ідентифікатори_варіантів_відповідей=то.option_ids
) : пусто

дія ВідповідьОпитування.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    poll_id=я.ідентифікатор_опитування,
    user=я.користувач,
    option_ids=я.ідентифікатори_варіантів_відповідей,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Опитування
  ідентифікатор текст
  питання текст
  варіанти_відповідей Список
  загальна_кількість_голосуючих число
  опитування_закрите логічне
  анонімне_опитування логічне
  тип текст
  дозволені_множинні_відповіді логічне
  ідентифікатор_правильної_відповіді число
  пояснення текст
  сутності_пояснення Список
  відкритий_період число
  дата_закриття число
кінець

Опитування.створити_з_телеграм_об'єкта = (то): то ? Опитування(
  ідентифікатор=то.id,
  питання=то.question,
  варіанти_відповідей=то.options,
  загальна_кількість_голосуючих=то.total_voter_count,
  опитування_закрите=то.is_closed,
  анонімне_опитування=то.is_anonymous,
  тип=то.type,
  дозволені_множинні_відповіді=то.allows_multiple_answers,
  ідентифікатор_правильної_відповіді=то.correct_option_id,
  пояснення=то.explanation,
  сутності_пояснення=то.explanation_entities,
  відкритий_період=то.open_period,
  дата_закриття=то.close_date
) : пусто

дія Опитування.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    id=я.ідентифікатор,
    question=я.питання,
    options=я.варіанти_відповідей,
    total_voter_count=я.загальна_кількість_голосуючих,
    is_closed=я.опитування_закрите,
    is_anonymous=я.анонімне_опитування,
    type=я.тип,
    allows_multiple_answers=я.дозволені_множинні_відповіді,
    correct_option_id=я.ідентифікатор_правильної_відповіді,
    explanation=я.пояснення,
    explanation_entities=я.сутності_пояснення,
    open_period=я.відкритий_період,
    close_date=я.дата_закриття,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Місцезнаходження
  довгота число
  широта число
  горизонтальна_точність число
  активний_період число
  напрямок число
  радіус_сповіщення число
кінець

Місцезнаходження.створити_з_телеграм_об'єкта = (то): то ? Місцезнаходження(
  довгота=то.longitude,
  широта=то.latitude,
  горизонтальна_точність=то.horizontal_accuracy,
  активний_період=то.live_period,
  напрямок=то.heading,
  радіус_сповіщення=то.proximity_alert_radius
) : пусто

дія Місцезнаходження.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    longitude=я.довгота,
    latitude=я.широта,
    horizontal_accuracy=я.горизонтальна_точність,
    live_period=я.активний_період,
    heading=я.напрямок,
    proximity_alert_radius=я.радіус_сповіщення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура МісцеЗустрічі
  розташування Місцезнаходження
  назва текст
  адреса текст
  ідентифікатор_Foursquare текст
  тип_Foursquare текст
  ідентифікатор_Google текст
  тип_Google текст
кінець

МісцеЗустрічі.створити_з_телеграм_об'єкта = (то): то ? МісцеЗустрічі(
  розташування=Місцезнаходження.створити_з_телеграм_об'єкта(то.location),
  назва=то.title,
  адреса=то.address,
  ідентифікатор_Foursquare=то.foursquare_id,
  тип_Foursquare=то.foursquare_type,
  ідентифікатор_Google=то.google_place_id,
  тип_Google=то.google_place_type
) : пусто

дія МісцеЗустрічі.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    location=я.розташування,
    title=я.назва,
    address=я.адреса,
    foursquare_id=я.ідентифікатор_Foursquare,
    foursquare_type=я.тип_Foursquare,
    google_place_id=я.ідентифікатор_Google,
    google_place_type=я.тип_Google,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ДаніВебДодатку
  дані текст
  текст_кнопки текст
кінець

ДаніВебДодатку.створити_з_телеграм_об'єкта = (то): то ? ДаніВебДодатку(
  дані=то.data,
  текст_кнопки=то.button_text
) : пусто

дія ДаніВебДодатку.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    data=я.дані,
    button_text=я.текст_кнопки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура СпрацюванняБлизькості
  подорожуючий Користувач
  спостерігач Користувач
  відстань число
кінець

СпрацюванняБлизькості.створити_з_телеграм_об'єкта = (то): то ? СпрацюванняБлизькості(
  подорожуючий=Користувач.створити_з_телеграм_об'єкта(то.traveler),
  спостерігач=Користувач.створити_з_телеграм_об'єкта(то.watcher),
  відстань=то.distance
) : пусто

дія СпрацюванняБлизькості.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    traveler=я.подорожуючий,
    watcher=я.спостерігач,
    distance=я.відстань,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗмінаТаймераАвтоВидаленняПовідомлення
  час_автоматичного_видалення_повідомлення число
кінець

ЗмінаТаймераАвтоВидаленняПовідомлення.створити_з_телеграм_об'єкта = (то): то ? ЗмінаТаймераАвтоВидаленняПовідомлення(
  час_автоматичного_видалення_повідомлення=то.message_auto_delete_time
) : пусто

дія ЗмінаТаймераАвтоВидаленняПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    message_auto_delete_time=я.час_автоматичного_видалення_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ТемуФорумуСтворено
  назва текст
  колір_іконки число
  ідентифікатор_спеціальної_емоджі_іконки текст
кінець

ТемуФорумуСтворено.створити_з_телеграм_об'єкта = (то): то ? ТемуФорумуСтворено(
  назва=то.name,
  колір_іконки=то.icon_color,
  ідентифікатор_спеціальної_емоджі_іконки=то.icon_custom_emoji_id
) : пусто

дія ТемуФорумуСтворено.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    name=я.назва,
    icon_color=я.колір_іконки,
    icon_custom_emoji_id=я.ідентифікатор_спеціальної_емоджі_іконки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ТемаФорумуЗакрита
кінець

ТемаФорумуЗакрита.створити_з_телеграм_об'єкта = (то): то ? ТемаФорумуЗакрита() : пусто

дія ТемаФорумуЗакрита.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура ТемуФорумуВідредаговано
  назва текст
  ідентифікатор_спеціальної_емоджі_іконки текст
кінець

ТемуФорумуВідредаговано.створити_з_телеграм_об'єкта = (то): то ? ТемуФорумуВідредаговано(
  назва=то.name,
  ідентифікатор_спеціальної_емоджі_іконки=то.icon_custom_emoji_id
) : пусто

дія ТемуФорумуВідредаговано.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    name=я.назва,
    icon_custom_emoji_id=я.ідентифікатор_спеціальної_емоджі_іконки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ТемаФорумуВідкрита
кінець

ТемаФорумуВідкрита.створити_з_телеграм_об'єкта = (то): то ? ТемаФорумуВідкрита() : пусто

дія ТемаФорумуВідкрита.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура ЗагальнаТемаФорумуПрихована
кінець

ЗагальнаТемаФорумуПрихована.створити_з_телеграм_об'єкта = (то): то ? ЗагальнаТемаФорумуПрихована() : пусто

дія ЗагальнаТемаФорумуПрихована.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура ЗагальнаТемаФорумуВідкрита
кінець

ЗагальнаТемаФорумуВідкрита.створити_з_телеграм_об'єкта = (то): то ? ЗагальнаТемаФорумуВідкрита() : пусто

дія ЗагальнаТемаФорумуВідкрита.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура КористувачаПоширено
  ідентифікатор_запиту число
  ідентифікатор_користувача число
кінець

КористувачаПоширено.створити_з_телеграм_об'єкта = (то): то ? КористувачаПоширено(
  ідентифікатор_запиту=то.request_id,
  ідентифікатор_користувача=то.user_id
) : пусто

дія КористувачаПоширено.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    request_id=я.ідентифікатор_запиту,
    user_id=я.ідентифікатор_користувача,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЧатПоширено
  ідентифікатор_запиту число
  ідентифікатор_чату число
кінець

ЧатПоширено.створити_з_телеграм_об'єкта = (то): то ? ЧатПоширено(
  ідентифікатор_запиту=то.request_id,
  ідентифікатор_чату=то.chat_id
) : пусто

дія ЧатПоширено.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    request_id=я.ідентифікатор_запиту,
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ДоступНаПисьмоДозволений
кінець

ДоступНаПисьмоДозволений.створити_з_телеграм_об'єкта = (то): то ? ДоступНаПисьмоДозволений() : пусто

дія ДоступНаПисьмоДозволений.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура ВідеоЧатЗаплановано
  дата_початку число
кінець

ВідеоЧатЗаплановано.створити_з_телеграм_об'єкта = (то): то ? ВідеоЧатЗаплановано(
  дата_початку=то.start_date
) : пусто

дія ВідеоЧатЗаплановано.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    start_date=я.дата_початку,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідеоЧатРозпочато
кінець

ВідеоЧатРозпочато.створити_з_телеграм_об'єкта = (то): то ? ВідеоЧатРозпочато() : пусто

дія ВідеоЧатРозпочато.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура ВідеоЧатЗавершено
  тривалість число
кінець

ВідеоЧатЗавершено.створити_з_телеграм_об'єкта = (то): то ? ВідеоЧатЗавершено(
  тривалість=то.duration
) : пусто

дія ВідеоЧатЗавершено.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    duration=я.тривалість,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗапрошенняУчасниківВідеоЧату
  користувачі Список
кінець

ЗапрошенняУчасниківВідеоЧату.створити_з_телеграм_об'єкта = (то): то ? ЗапрошенняУчасниківВідеоЧату(
  користувачі=то.users
) : пусто

дія ЗапрошенняУчасниківВідеоЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    users=я.користувачі,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ФотоПрофілю
  загальна_кількість число
  фотографії Список
кінець

ФотоПрофілю.створити_з_телеграм_об'єкта = (то): то ? ФотоПрофілю(
  загальна_кількість=то.total_count,
  фотографії=то.photos
) : пусто

дія ФотоПрофілю.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    total_count=я.загальна_кількість,
    photos=я.фотографії,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Файл
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  розмір_файлу число
  шлях_до_файлу текст
кінець

Файл.створити_з_телеграм_об'єкта = (то): то ? Файл(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  розмір_файлу=то.file_size,
  шлях_до_файлу=то.file_path
) : пусто

дія Файл.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    file_size=я.розмір_файлу,
    file_path=я.шлях_до_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ІнформаціяВебДодатку
  урл текст
кінець

ІнформаціяВебДодатку.створити_з_телеграм_об'єкта = (то): то ? ІнформаціяВебДодатку(
  урл=то.url
) : пусто

дія ІнформаціяВебДодатку.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    url=я.урл,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РозміткаКлавіатуриВідповіді
  клавіатура Список
  постійний логічне
  зміна_розміру_клавіатури логічне
  одноразова_клавіатура логічне
  підказка_для_поля_введення текст
  вибірковий логічне
кінець

РозміткаКлавіатуриВідповіді.створити_з_телеграм_об'єкта = (то): то ? РозміткаКлавіатуриВідповіді(
  клавіатура=то.keyboard,
  постійний=то.is_persistent,
  зміна_розміру_клавіатури=то.resize_keyboard,
  одноразова_клавіатура=то.one_time_keyboard,
  підказка_для_поля_введення=то.input_field_placeholder,
  вибірковий=то.selective
) : пусто

дія РозміткаКлавіатуриВідповіді.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    keyboard=я.клавіатура,
    is_persistent=я.постійний,
    resize_keyboard=я.зміна_розміру_клавіатури,
    one_time_keyboard=я.одноразова_клавіатура,
    input_field_placeholder=я.підказка_для_поля_введення,
    selective=я.вибірковий,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КлавішаКлавіатури
  текст текст
  запит_користувача КлавішаКлавіатуриЗапитатиКористувача
  запит_чату КлавішаКлавіатуриЗапитатиЧат
  запит_контакту логічне
  запит_локації логічне
  запит_опитування КлавішаКлавіатуриЗапитатиОпитування
  веб_додаток ІнформаціяВебДодатку
кінець

КлавішаКлавіатури.створити_з_телеграм_об'єкта = (то): то ? КлавішаКлавіатури(
  текст=то.text,
  запит_користувача=КлавішаКлавіатуриЗапитатиКористувача.створити_з_телеграм_об'єкта(то.request_user),
  запит_чату=КлавішаКлавіатуриЗапитатиЧат.створити_з_телеграм_об'єкта(то.request_chat),
  запит_контакту=то.request_contact,
  запит_локації=то.request_location,
  запит_опитування=КлавішаКлавіатуриЗапитатиОпитування.створити_з_телеграм_об'єкта(то.request_poll),
  веб_додаток=ІнформаціяВебДодатку.створити_з_телеграм_об'єкта(то.web_app)
) : пусто

дія КлавішаКлавіатури.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    text=я.текст,
    request_user=я.запит_користувача,
    request_chat=я.запит_чату,
    request_contact=я.запит_контакту,
    request_location=я.запит_локації,
    request_poll=я.запит_опитування,
    web_app=я.веб_додаток,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КлавішаКлавіатуриЗапитатиКористувача
  ідентифікатор_запиту число
  користувач_є_ботом логічне
  користувач_має_преміум логічне
кінець

КлавішаКлавіатуриЗапитатиКористувача.створити_з_телеграм_об'єкта = (то): то ? КлавішаКлавіатуриЗапитатиКористувача(
  ідентифікатор_запиту=то.request_id,
  користувач_є_ботом=то.user_is_bot,
  користувач_має_преміум=то.user_is_premium
) : пусто

дія КлавішаКлавіатуриЗапитатиКористувача.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    request_id=я.ідентифікатор_запиту,
    user_is_bot=я.користувач_є_ботом,
    user_is_premium=я.користувач_має_преміум,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КлавішаКлавіатуриЗапитатиЧат
  ідентифікатор_запиту число
  чат_є_каналом логічне
  чат_є_форумом логічне
  чат_має_ім'я_користувача логічне
  чат_створено логічне
  права_адміністратора_користувача ПраваАдміністратораЧату
  права_адміністратора_бота ПраваАдміністратораЧату
  бот_є_учасником логічне
кінець

КлавішаКлавіатуриЗапитатиЧат.створити_з_телеграм_об'єкта = (то): то ? КлавішаКлавіатуриЗапитатиЧат(
  ідентифікатор_запиту=то.request_id,
  чат_є_каналом=то.chat_is_channel,
  чат_є_форумом=то.chat_is_forum,
  чат_має_ім'я_користувача=то.chat_has_username,
  чат_створено=то.chat_is_created,
  права_адміністратора_користувача=ПраваАдміністратораЧату.створити_з_телеграм_об'єкта(то.user_administrator_rights),
  права_адміністратора_бота=ПраваАдміністратораЧату.створити_з_телеграм_об'єкта(то.bot_administrator_rights),
  бот_є_учасником=то.bot_is_member
) : пусто

дія КлавішаКлавіатуриЗапитатиЧат.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    request_id=я.ідентифікатор_запиту,
    chat_is_channel=я.чат_є_каналом,
    chat_is_forum=я.чат_є_форумом,
    chat_has_username=я.чат_має_ім'я_користувача,
    chat_is_created=я.чат_створено,
    user_administrator_rights=я.права_адміністратора_користувача,
    bot_administrator_rights=я.права_адміністратора_бота,
    bot_is_member=я.бот_є_учасником,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КлавішаКлавіатуриЗапитатиОпитування
  тип текст
кінець

КлавішаКлавіатуриЗапитатиОпитування.створити_з_телеграм_об'єкта = (то): то ? КлавішаКлавіатуриЗапитатиОпитування(
  тип=то.type
) : пусто

дія КлавішаКлавіатуриЗапитатиОпитування.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПрибратиКлавіатуруВідповіді
  видалити_клавіатуру логічне
  вибірковий логічне
кінець

ПрибратиКлавіатуруВідповіді.створити_з_телеграм_об'єкта = (то): то ? ПрибратиКлавіатуруВідповіді(
  видалити_клавіатуру=то.remove_keyboard,
  вибірковий=то.selective
) : пусто

дія ПрибратиКлавіатуруВідповіді.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    remove_keyboard=я.видалити_клавіатуру,
    selective=я.вибірковий,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РозміткаІнлайнКлавіатури
  інлайн_клавіатура Список
кінець

РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта = (то): то ? РозміткаІнлайнКлавіатури(
  інлайн_клавіатура=то.inline_keyboard
) : пусто

дія РозміткаІнлайнКлавіатури.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    inline_keyboard=я.інлайн_клавіатура,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КлавішаІнлайнКлавіатури
  текст текст
  урл текст
  дані_для_виклику текст
  веб_додаток ІнформаціяВебДодатку
  url_входу ПосиланняАвторизації
  переключити_інлайн_запит текст
  переключити_інлайн_запит_поточного_чату текст
  ігри_для_виклику ЗворотнійВикликГра
  оплатити логічне
кінець

КлавішаІнлайнКлавіатури.створити_з_телеграм_об'єкта = (то): то ? КлавішаІнлайнКлавіатури(
  текст=то.text,
  урл=то.url,
  дані_для_виклику=то.callback_data,
  веб_додаток=ІнформаціяВебДодатку.створити_з_телеграм_об'єкта(то.web_app),
  url_входу=ПосиланняАвторизації.створити_з_телеграм_об'єкта(то.login_url),
  переключити_інлайн_запит=то.switch_inline_query,
  переключити_інлайн_запит_поточного_чату=то.switch_inline_query_current_chat,
  ігри_для_виклику=ЗворотнійВикликГра.створити_з_телеграм_об'єкта(то.callback_game),
  оплатити=то.pay
) : пусто

дія КлавішаІнлайнКлавіатури.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    text=я.текст,
    url=я.урл,
    callback_data=я.дані_для_виклику,
    web_app=я.веб_додаток,
    login_url=я.url_входу,
    switch_inline_query=я.переключити_інлайн_запит,
    switch_inline_query_current_chat=я.переключити_інлайн_запит_поточного_чату,
    callback_game=я.ігри_для_виклику,
    pay=я.оплатити,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПосиланняАвторизації
  урл текст
  переслати_текст текст
  ім'я_бота текст
  запит_на_доступ_до_запису логічне
кінець

ПосиланняАвторизації.створити_з_телеграм_об'єкта = (то): то ? ПосиланняАвторизації(
  урл=то.url,
  переслати_текст=то.forward_text,
  ім'я_бота=то.bot_username,
  запит_на_доступ_до_запису=то.request_write_access
) : пусто

дія ПосиланняАвторизації.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    url=я.урл,
    forward_text=я.переслати_текст,
    bot_username=я.ім'я_бота,
    request_write_access=я.запит_на_доступ_до_запису,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗапитЗворотньогоВиклику
  ідентифікатор текст
  від Користувач
  повідомлення Повідомлення
  ідентифікатор_інлайн_повідомлення текст
  інстанція_чату текст
  дані текст
  коротке_ім'я_гри текст
кінець

ЗапитЗворотньогоВиклику.створити_з_телеграм_об'єкта = (то): то ? ЗапитЗворотньогоВиклику(
  ідентифікатор=то.id,
  від=Користувач.створити_з_телеграм_об'єкта(то.from),
  повідомлення=Повідомлення.створити_з_телеграм_об'єкта(то.message),
  ідентифікатор_інлайн_повідомлення=то.inline_message_id,
  інстанція_чату=то.chat_instance,
  дані=то.data,
  коротке_ім'я_гри=то.game_short_name
) : пусто

дія ЗапитЗворотньогоВиклику.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    id=я.ідентифікатор,
    from=я.від,
    message=я.повідомлення,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    chat_instance=я.інстанція_чату,
    data=я.дані,
    game_short_name=я.коротке_ім'я_гри,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПримусоваВідповідь
  примусова_відповідь логічне
  підказка_для_поля_введення текст
  вибірковий логічне
кінець

ПримусоваВідповідь.створити_з_телеграм_об'єкта = (то): то ? ПримусоваВідповідь(
  примусова_відповідь=то.force_reply,
  підказка_для_поля_введення=то.input_field_placeholder,
  вибірковий=то.selective
) : пусто

дія ПримусоваВідповідь.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    force_reply=я.примусова_відповідь,
    input_field_placeholder=я.підказка_для_поля_введення,
    selective=я.вибірковий,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ФотоЧату
  ідентифікатор_маленького_файлу текст
  унікальний_ідентифікатор_маленького_файлу текст
  ідентифікатор_великого_файлу текст
  унікальний_ідентифікатор_великого_файлу текст
кінець

ФотоЧату.створити_з_телеграм_об'єкта = (то): то ? ФотоЧату(
  ідентифікатор_маленького_файлу=то.small_file_id,
  унікальний_ідентифікатор_маленького_файлу=то.small_file_unique_id,
  ідентифікатор_великого_файлу=то.big_file_id,
  унікальний_ідентифікатор_великого_файлу=то.big_file_unique_id
) : пусто

дія ФотоЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    small_file_id=я.ідентифікатор_маленького_файлу,
    small_file_unique_id=я.унікальний_ідентифікатор_маленького_файлу,
    big_file_id=я.ідентифікатор_великого_файлу,
    big_file_unique_id=я.унікальний_ідентифікатор_великого_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПосиланняНаЗапрошенняДоЧату
  посилання_запрошення текст
  створювач Користувач
  створює_запит_на_вступ логічне
  є_первинним логічне
  було_відкликано логічне
  назва текст
  дата_закінчення число
  ліміт_учасників число
  кількість_очікуючих_запитів_на_вступ число
кінець

ПосиланняНаЗапрошенняДоЧату.створити_з_телеграм_об'єкта = (то): то ? ПосиланняНаЗапрошенняДоЧату(
  посилання_запрошення=то.invite_link,
  створювач=Користувач.створити_з_телеграм_об'єкта(то.creator),
  створює_запит_на_вступ=то.creates_join_request,
  є_первинним=то.is_primary,
  було_відкликано=то.is_revoked,
  назва=то.name,
  дата_закінчення=то.expire_date,
  ліміт_учасників=то.member_limit,
  кількість_очікуючих_запитів_на_вступ=то.pending_join_request_count
) : пусто

дія ПосиланняНаЗапрошенняДоЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    invite_link=я.посилання_запрошення,
    creator=я.створювач,
    creates_join_request=я.створює_запит_на_вступ,
    is_primary=я.є_первинним,
    is_revoked=я.було_відкликано,
    name=я.назва,
    expire_date=я.дата_закінчення,
    member_limit=я.ліміт_учасників,
    pending_join_request_count=я.кількість_очікуючих_запитів_на_вступ,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПраваАдміністратораЧату
  анонімне_опитування логічне
  може_керувати_чатом логічне
  може_видаляти_повідомлення логічне
  може_керувати_відеоконференціями логічне
  може_обмежувати_учасників логічне
  може_підвищувати_учасників логічне
  може_змінювати_інформацію логічне
  може_запрошувати_користувачів логічне
  може_публікувати_повідомлення логічне
  може_редагувати_повідомлення логічне
  може_закріплювати_повідомлення логічне
  може_керувати_темами логічне
кінець

ПраваАдміністратораЧату.створити_з_телеграм_об'єкта = (то): то ? ПраваАдміністратораЧату(
  анонімне_опитування=то.is_anonymous,
  може_керувати_чатом=то.can_manage_chat,
  може_видаляти_повідомлення=то.can_delete_messages,
  може_керувати_відеоконференціями=то.can_manage_video_chats,
  може_обмежувати_учасників=то.can_restrict_members,
  може_підвищувати_учасників=то.can_promote_members,
  може_змінювати_інформацію=то.can_change_info,
  може_запрошувати_користувачів=то.can_invite_users,
  може_публікувати_повідомлення=то.can_post_messages,
  може_редагувати_повідомлення=то.can_edit_messages,
  може_закріплювати_повідомлення=то.can_pin_messages,
  може_керувати_темами=то.can_manage_topics
) : пусто

дія ПраваАдміністратораЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    is_anonymous=я.анонімне_опитування,
    can_manage_chat=я.може_керувати_чатом,
    can_delete_messages=я.може_видаляти_повідомлення,
    can_manage_video_chats=я.може_керувати_відеоконференціями,
    can_restrict_members=я.може_обмежувати_учасників,
    can_promote_members=я.може_підвищувати_учасників,
    can_change_info=я.може_змінювати_інформацію,
    can_invite_users=я.може_запрошувати_користувачів,
    can_post_messages=я.може_публікувати_повідомлення,
    can_edit_messages=я.може_редагувати_повідомлення,
    can_pin_messages=я.може_закріплювати_повідомлення,
    can_manage_topics=я.може_керувати_темами,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура УчасникЧату
кінець

УчасникЧату.створити_з_телеграм_об'єкта = (то): то ? УчасникЧату() : пусто

дія УчасникЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура УчасникЧатуВласник
  статус текст
  користувач Користувач
  анонімне_опитування логічне
  індивідуальний_заголовок текст
кінець

УчасникЧатуВласник.створити_з_телеграм_об'єкта = (то): то ? УчасникЧатуВласник(
  статус=то.status,
  користувач=Користувач.створити_з_телеграм_об'єкта(то.user),
  анонімне_опитування=то.is_anonymous,
  індивідуальний_заголовок=то.custom_title
) : пусто

дія УчасникЧатуВласник.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    status=я.статус,
    user=я.користувач,
    is_anonymous=я.анонімне_опитування,
    custom_title=я.індивідуальний_заголовок,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура УчасникЧатуАдміністратор
  статус текст
  користувач Користувач
  може_бути_змінене логічне
  анонімне_опитування логічне
  може_керувати_чатом логічне
  може_видаляти_повідомлення логічне
  може_керувати_відеоконференціями логічне
  може_обмежувати_учасників логічне
  може_підвищувати_учасників логічне
  може_змінювати_інформацію логічне
  може_запрошувати_користувачів логічне
  може_публікувати_повідомлення логічне
  може_редагувати_повідомлення логічне
  може_закріплювати_повідомлення логічне
  може_керувати_темами логічне
  індивідуальний_заголовок текст
кінець

УчасникЧатуАдміністратор.створити_з_телеграм_об'єкта = (то): то ? УчасникЧатуАдміністратор(
  статус=то.status,
  користувач=Користувач.створити_з_телеграм_об'єкта(то.user),
  може_бути_змінене=то.can_be_edited,
  анонімне_опитування=то.is_anonymous,
  може_керувати_чатом=то.can_manage_chat,
  може_видаляти_повідомлення=то.can_delete_messages,
  може_керувати_відеоконференціями=то.can_manage_video_chats,
  може_обмежувати_учасників=то.can_restrict_members,
  може_підвищувати_учасників=то.can_promote_members,
  може_змінювати_інформацію=то.can_change_info,
  може_запрошувати_користувачів=то.can_invite_users,
  може_публікувати_повідомлення=то.can_post_messages,
  може_редагувати_повідомлення=то.can_edit_messages,
  може_закріплювати_повідомлення=то.can_pin_messages,
  може_керувати_темами=то.can_manage_topics,
  індивідуальний_заголовок=то.custom_title
) : пусто

дія УчасникЧатуАдміністратор.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    status=я.статус,
    user=я.користувач,
    can_be_edited=я.може_бути_змінене,
    is_anonymous=я.анонімне_опитування,
    can_manage_chat=я.може_керувати_чатом,
    can_delete_messages=я.може_видаляти_повідомлення,
    can_manage_video_chats=я.може_керувати_відеоконференціями,
    can_restrict_members=я.може_обмежувати_учасників,
    can_promote_members=я.може_підвищувати_учасників,
    can_change_info=я.може_змінювати_інформацію,
    can_invite_users=я.може_запрошувати_користувачів,
    can_post_messages=я.може_публікувати_повідомлення,
    can_edit_messages=я.може_редагувати_повідомлення,
    can_pin_messages=я.може_закріплювати_повідомлення,
    can_manage_topics=я.може_керувати_темами,
    custom_title=я.індивідуальний_заголовок,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура УчасникЧатуУчасник
  статус текст
  користувач Користувач
кінець

УчасникЧатуУчасник.створити_з_телеграм_об'єкта = (то): то ? УчасникЧатуУчасник(
  статус=то.status,
  користувач=Користувач.створити_з_телеграм_об'єкта(то.user)
) : пусто

дія УчасникЧатуУчасник.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    status=я.статус,
    user=я.користувач,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОбмеженийУчасникЧату
  статус текст
  користувач Користувач
  є_учасником логічне
  може_надсилати_повідомлення логічне
  може_надсилати_аудіо логічне
  може_надсилати_документи логічне
  може_надсилати_фото логічне
  може_надсилати_відео логічне
  може_надсилати_відео_з_нотатками логічне
  може_надсилати_голосові_повідомлення логічне
  може_надсилати_опитування логічне
  може_надсилати_інші_повідомлення логічне
  може_додавати_перегляд_вебсторінок логічне
  може_змінювати_інформацію логічне
  може_запрошувати_користувачів логічне
  може_закріплювати_повідомлення логічне
  може_керувати_темами логічне
  до_дати число
кінець

ОбмеженийУчасникЧату.створити_з_телеграм_об'єкта = (то): то ? ОбмеженийУчасникЧату(
  статус=то.status,
  користувач=Користувач.створити_з_телеграм_об'єкта(то.user),
  є_учасником=то.is_member,
  може_надсилати_повідомлення=то.can_send_messages,
  може_надсилати_аудіо=то.can_send_audios,
  може_надсилати_документи=то.can_send_documents,
  може_надсилати_фото=то.can_send_photos,
  може_надсилати_відео=то.can_send_videos,
  може_надсилати_відео_з_нотатками=то.can_send_video_notes,
  може_надсилати_голосові_повідомлення=то.can_send_voice_notes,
  може_надсилати_опитування=то.can_send_polls,
  може_надсилати_інші_повідомлення=то.can_send_other_messages,
  може_додавати_перегляд_вебсторінок=то.can_add_web_page_previews,
  може_змінювати_інформацію=то.can_change_info,
  може_запрошувати_користувачів=то.can_invite_users,
  може_закріплювати_повідомлення=то.can_pin_messages,
  може_керувати_темами=то.can_manage_topics,
  до_дати=то.until_date
) : пусто

дія ОбмеженийУчасникЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    status=я.статус,
    user=я.користувач,
    is_member=я.є_учасником,
    can_send_messages=я.може_надсилати_повідомлення,
    can_send_audios=я.може_надсилати_аудіо,
    can_send_documents=я.може_надсилати_документи,
    can_send_photos=я.може_надсилати_фото,
    can_send_videos=я.може_надсилати_відео,
    can_send_video_notes=я.може_надсилати_відео_з_нотатками,
    can_send_voice_notes=я.може_надсилати_голосові_повідомлення,
    can_send_polls=я.може_надсилати_опитування,
    can_send_other_messages=я.може_надсилати_інші_повідомлення,
    can_add_web_page_previews=я.може_додавати_перегляд_вебсторінок,
    can_change_info=я.може_змінювати_інформацію,
    can_invite_users=я.може_запрошувати_користувачів,
    can_pin_messages=я.може_закріплювати_повідомлення,
    can_manage_topics=я.може_керувати_темами,
    until_date=я.до_дати,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПокинутийУчасникЧату
  статус текст
  користувач Користувач
кінець

ПокинутийУчасникЧату.створити_з_телеграм_об'єкта = (то): то ? ПокинутийУчасникЧату(
  статус=то.status,
  користувач=Користувач.створити_з_телеграм_об'єкта(то.user)
) : пусто

дія ПокинутийУчасникЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    status=я.статус,
    user=я.користувач,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗаблокованийУчасникЧату
  статус текст
  користувач Користувач
  до_дати число
кінець

ЗаблокованийУчасникЧату.створити_з_телеграм_об'єкта = (то): то ? ЗаблокованийУчасникЧату(
  статус=то.status,
  користувач=Користувач.створити_з_телеграм_об'єкта(то.user),
  до_дати=то.until_date
) : пусто

дія ЗаблокованийУчасникЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    status=я.статус,
    user=я.користувач,
    until_date=я.до_дати,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура УчасникаЧатуОновлено
  чат Чат
  від Користувач
  дата число
  старий_учасник_чату УчасникЧату
  новий_учасник_чату УчасникЧату
  посилання_запрошення ПосиланняНаЗапрошенняДоЧату
кінець

УчасникаЧатуОновлено.створити_з_телеграм_об'єкта = (то): то ? УчасникаЧатуОновлено(
  чат=Чат.створити_з_телеграм_об'єкта(то.chat),
  від=Користувач.створити_з_телеграм_об'єкта(то.from),
  дата=то.date,
  старий_учасник_чату=УчасникЧату.створити_з_телеграм_об'єкта(то.old_chat_member),
  новий_учасник_чату=УчасникЧату.створити_з_телеграм_об'єкта(то.new_chat_member),
  посилання_запрошення=ПосиланняНаЗапрошенняДоЧату.створити_з_телеграм_об'єкта(то.invite_link)
) : пусто

дія УчасникаЧатуОновлено.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat=я.чат,
    from=я.від,
    date=я.дата,
    old_chat_member=я.старий_учасник_чату,
    new_chat_member=я.новий_учасник_чату,
    invite_link=я.посилання_запрошення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗапитНаПриєднанняДоЧату
  чат Чат
  від Користувач
  ідентифікатор_користувача_в_чаті число
  дата число
  біографія текст
  посилання_запрошення ПосиланняНаЗапрошенняДоЧату
кінець

ЗапитНаПриєднанняДоЧату.створити_з_телеграм_об'єкта = (то): то ? ЗапитНаПриєднанняДоЧату(
  чат=Чат.створити_з_телеграм_об'єкта(то.chat),
  від=Користувач.створити_з_телеграм_об'єкта(то.from),
  ідентифікатор_користувача_в_чаті=то.user_chat_id,
  дата=то.date,
  біографія=то.bio,
  посилання_запрошення=ПосиланняНаЗапрошенняДоЧату.створити_з_телеграм_об'єкта(то.invite_link)
) : пусто

дія ЗапитНаПриєднанняДоЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat=я.чат,
    from=я.від,
    user_chat_id=я.ідентифікатор_користувача_в_чаті,
    date=я.дата,
    bio=я.біографія,
    invite_link=я.посилання_запрошення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ДозволиЧату
  може_надсилати_повідомлення логічне
  може_надсилати_аудіо логічне
  може_надсилати_документи логічне
  може_надсилати_фото логічне
  може_надсилати_відео логічне
  може_надсилати_відео_з_нотатками логічне
  може_надсилати_голосові_повідомлення логічне
  може_надсилати_опитування логічне
  може_надсилати_інші_повідомлення логічне
  може_додавати_перегляд_вебсторінок логічне
  може_змінювати_інформацію логічне
  може_запрошувати_користувачів логічне
  може_закріплювати_повідомлення логічне
  може_керувати_темами логічне
кінець

ДозволиЧату.створити_з_телеграм_об'єкта = (то): то ? ДозволиЧату(
  може_надсилати_повідомлення=то.can_send_messages,
  може_надсилати_аудіо=то.can_send_audios,
  може_надсилати_документи=то.can_send_documents,
  може_надсилати_фото=то.can_send_photos,
  може_надсилати_відео=то.can_send_videos,
  може_надсилати_відео_з_нотатками=то.can_send_video_notes,
  може_надсилати_голосові_повідомлення=то.can_send_voice_notes,
  може_надсилати_опитування=то.can_send_polls,
  може_надсилати_інші_повідомлення=то.can_send_other_messages,
  може_додавати_перегляд_вебсторінок=то.can_add_web_page_previews,
  може_змінювати_інформацію=то.can_change_info,
  може_запрошувати_користувачів=то.can_invite_users,
  може_закріплювати_повідомлення=то.can_pin_messages,
  може_керувати_темами=то.can_manage_topics
) : пусто

дія ДозволиЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    can_send_messages=я.може_надсилати_повідомлення,
    can_send_audios=я.може_надсилати_аудіо,
    can_send_documents=я.може_надсилати_документи,
    can_send_photos=я.може_надсилати_фото,
    can_send_videos=я.може_надсилати_відео,
    can_send_video_notes=я.може_надсилати_відео_з_нотатками,
    can_send_voice_notes=я.може_надсилати_голосові_повідомлення,
    can_send_polls=я.може_надсилати_опитування,
    can_send_other_messages=я.може_надсилати_інші_повідомлення,
    can_add_web_page_previews=я.може_додавати_перегляд_вебсторінок,
    can_change_info=я.може_змінювати_інформацію,
    can_invite_users=я.може_запрошувати_користувачів,
    can_pin_messages=я.може_закріплювати_повідомлення,
    can_manage_topics=я.може_керувати_темами,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура МісцезнаходженняЧату
  розташування Місцезнаходження
  адреса текст
кінець

МісцезнаходженняЧату.створити_з_телеграм_об'єкта = (то): то ? МісцезнаходженняЧату(
  розташування=Місцезнаходження.створити_з_телеграм_об'єкта(то.location),
  адреса=то.address
) : пусто

дія МісцезнаходженняЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    location=я.розташування,
    address=я.адреса,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ТемаФоруму
  ідентифікатор_теми_повідомлення число
  назва текст
  колір_іконки число
  ідентифікатор_спеціальної_емоджі_іконки текст
кінець

ТемаФоруму.створити_з_телеграм_об'єкта = (то): то ? ТемаФоруму(
  ідентифікатор_теми_повідомлення=то.message_thread_id,
  назва=то.name,
  колір_іконки=то.icon_color,
  ідентифікатор_спеціальної_емоджі_іконки=то.icon_custom_emoji_id
) : пусто

дія ТемаФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    name=я.назва,
    icon_color=я.колір_іконки,
    icon_custom_emoji_id=я.ідентифікатор_спеціальної_емоджі_іконки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КомандаБота
  команда текст
  опис текст
кінець

КомандаБота.створити_з_телеграм_об'єкта = (то): то ? КомандаБота(
  команда=то.command,
  опис=то.description
) : пусто

дія КомандаБота.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    command=я.команда,
    description=я.опис,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОбсягКомандБота
кінець

ОбсягКомандБота.створити_з_телеграм_об'єкта = (то): то ? ОбсягКомандБота() : пусто

дія ОбсягКомандБота.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура BotCommandScopeDefault
  тип текст
кінець

BotCommandScopeDefault.створити_з_телеграм_об'єкта = (то): то ? BotCommandScopeDefault(
  тип=то.type
) : пусто

дія BotCommandScopeDefault.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура BotCommandScopeAllPrivateChats
  тип текст
кінець

BotCommandScopeAllPrivateChats.створити_з_телеграм_об'єкта = (то): то ? BotCommandScopeAllPrivateChats(
  тип=то.type
) : пусто

дія BotCommandScopeAllPrivateChats.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура BotCommandScopeAllGroupChats
  тип текст
кінець

BotCommandScopeAllGroupChats.створити_з_телеграм_об'єкта = (то): то ? BotCommandScopeAllGroupChats(
  тип=то.type
) : пусто

дія BotCommandScopeAllGroupChats.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура BotCommandScopeAllChatAdministrators
  тип текст
кінець

BotCommandScopeAllChatAdministrators.створити_з_телеграм_об'єкта = (то): то ? BotCommandScopeAllChatAdministrators(
  тип=то.type
) : пусто

дія BotCommandScopeAllChatAdministrators.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура BotCommandScopeChat
  тип текст
  ідентифікатор_чату число
кінець

BotCommandScopeChat.створити_з_телеграм_об'єкта = (то): то ? BotCommandScopeChat(
  тип=то.type,
  ідентифікатор_чату=то.chat_id
) : пусто

дія BotCommandScopeChat.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура BotCommandScopeChatAdministrators
  тип текст
  ідентифікатор_чату число
кінець

BotCommandScopeChatAdministrators.створити_з_телеграм_об'єкта = (то): то ? BotCommandScopeChatAdministrators(
  тип=то.type,
  ідентифікатор_чату=то.chat_id
) : пусто

дія BotCommandScopeChatAdministrators.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура BotCommandScopeChatMember
  тип текст
  ідентифікатор_чату число
  ідентифікатор_користувача число
кінець

BotCommandScopeChatMember.створити_з_телеграм_об'єкта = (то): то ? BotCommandScopeChatMember(
  тип=то.type,
  ідентифікатор_чату=то.chat_id,
  ідентифікатор_користувача=то.user_id
) : пусто

дія BotCommandScopeChatMember.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    chat_id=я.ідентифікатор_чату,
    user_id=я.ідентифікатор_користувача,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КнопкаМеню
кінець

КнопкаМеню.створити_з_телеграм_об'єкта = (то): то ? КнопкаМеню() : пусто

дія КнопкаМеню.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура КнопкаМенюКоманди
  тип текст
кінець

КнопкаМенюКоманди.створити_з_телеграм_об'єкта = (то): то ? КнопкаМенюКоманди(
  тип=то.type
) : пусто

дія КнопкаМенюКоманди.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КнопкаМенюВебДодаток
  тип текст
  текст текст
  веб_додаток ІнформаціяВебДодатку
кінець

КнопкаМенюВебДодаток.створити_з_телеграм_об'єкта = (то): то ? КнопкаМенюВебДодаток(
  тип=то.type,
  текст=то.text,
  веб_додаток=ІнформаціяВебДодатку.створити_з_телеграм_об'єкта(то.web_app)
) : пусто

дія КнопкаМенюВебДодаток.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    text=я.текст,
    web_app=я.веб_додаток,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КнопкаМенюЗаЗамовчуванням
  тип текст
кінець

КнопкаМенюЗаЗамовчуванням.створити_з_телеграм_об'єкта = (то): то ? КнопкаМенюЗаЗамовчуванням(
  тип=то.type
) : пусто

дія КнопкаМенюЗаЗамовчуванням.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПараметриВідповіді
  перенесено_до_ідентифікатора_чату число
  спробуйте_пізніше число
кінець

ПараметриВідповіді.створити_з_телеграм_об'єкта = (то): то ? ПараметриВідповіді(
  перенесено_до_ідентифікатора_чату=то.migrate_to_chat_id,
  спробуйте_пізніше=то.retry_after
) : пусто

дія ПараметриВідповіді.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    migrate_to_chat_id=я.перенесено_до_ідентифікатора_чату,
    retry_after=я.спробуйте_пізніше,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВвідМедіа
кінець

ВвідМедіа.створити_з_телеграм_об'єкта = (то): то ? ВвідМедіа() : пусто

дія ВвідМедіа.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура ВхіднеМедіаФото
  тип текст
  медіа текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  має_спойлер логічне
кінець

ВхіднеМедіаФото.створити_з_телеграм_об'єкта = (то): то ? ВхіднеМедіаФото(
  тип=то.type,
  медіа=то.media,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  має_спойлер=то.has_spoiler
) : пусто

дія ВхіднеМедіаФото.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    media=я.медіа,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    has_spoiler=я.має_спойлер,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВхіднеМедіаВідео
  тип текст
  медіа текст
  мініатюра ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  ширина число
  висота число
  тривалість число
  підтримує_стрімінг логічне
  має_спойлер логічне
кінець

ВхіднеМедіаВідео.створити_з_телеграм_об'єкта = (то): то ? ВхіднеМедіаВідео(
  тип=то.type,
  медіа=то.media,
  мініатюра=ВвідФайлу.створити_з_телеграм_об'єкта(то.thumb),
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  ширина=то.width,
  висота=то.height,
  тривалість=то.duration,
  підтримує_стрімінг=то.supports_streaming,
  має_спойлер=то.has_spoiler
) : пусто

дія ВхіднеМедіаВідео.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    media=я.медіа,
    thumb=я.мініатюра,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    width=я.ширина,
    height=я.висота,
    duration=я.тривалість,
    supports_streaming=я.підтримує_стрімінг,
    has_spoiler=я.має_спойлер,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВхіднеМедіаАнімація
  тип текст
  медіа текст
  мініатюра ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  ширина число
  висота число
  тривалість число
  має_спойлер логічне
кінець

ВхіднеМедіаАнімація.створити_з_телеграм_об'єкта = (то): то ? ВхіднеМедіаАнімація(
  тип=то.type,
  медіа=то.media,
  мініатюра=ВвідФайлу.створити_з_телеграм_об'єкта(то.thumb),
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  ширина=то.width,
  висота=то.height,
  тривалість=то.duration,
  має_спойлер=то.has_spoiler
) : пусто

дія ВхіднеМедіаАнімація.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    media=я.медіа,
    thumb=я.мініатюра,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    width=я.ширина,
    height=я.висота,
    duration=я.тривалість,
    has_spoiler=я.має_спойлер,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВхіднеМедіаАудіо
  тип текст
  медіа текст
  мініатюра ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  тривалість число
  виконавець текст
  назва текст
кінець

ВхіднеМедіаАудіо.створити_з_телеграм_об'єкта = (то): то ? ВхіднеМедіаАудіо(
  тип=то.type,
  медіа=то.media,
  мініатюра=ВвідФайлу.створити_з_телеграм_об'єкта(то.thumb),
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  тривалість=то.duration,
  виконавець=то.performer,
  назва=то.title
) : пусто

дія ВхіднеМедіаАудіо.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    media=я.медіа,
    thumb=я.мініатюра,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    duration=я.тривалість,
    performer=я.виконавець,
    title=я.назва,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВхіднеМедіаДокумент
  тип текст
  медіа текст
  мініатюра ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  вимкнути_визначення_типу_контенту логічне
кінець

ВхіднеМедіаДокумент.створити_з_телеграм_об'єкта = (то): то ? ВхіднеМедіаДокумент(
  тип=то.type,
  медіа=то.media,
  мініатюра=ВвідФайлу.створити_з_телеграм_об'єкта(то.thumb),
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  вимкнути_визначення_типу_контенту=то.disable_content_type_detection
) : пусто

дія ВхіднеМедіаДокумент.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    media=я.медіа,
    thumb=я.мініатюра,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    disable_content_type_detection=я.вимкнути_визначення_типу_контенту,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВвідФайлу
кінець

ВвідФайлу.створити_з_телеграм_об'єкта = (то): то ? ВвідФайлу() : пусто

дія ВвідФайлу.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура Стікер
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  тип текст
  ширина число
  висота число
  є_анімованим логічне
  є_відео логічне
  мініатюра РозмірФото
  емодзі текст
  встановити_ім'я текст
  преміум_анімація Файл
  позиція_маски ПозиціяМаски
  ідентифікатор_спеціального_емодзі текст
  розмір_файлу число
кінець

Стікер.створити_з_телеграм_об'єкта = (то): то ? Стікер(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  тип=то.type,
  ширина=то.width,
  висота=то.height,
  є_анімованим=то.is_animated,
  є_відео=то.is_video,
  мініатюра=РозмірФото.створити_з_телеграм_об'єкта(то.thumb),
  емодзі=то.emoji,
  встановити_ім'я=то.set_name,
  преміум_анімація=Файл.створити_з_телеграм_об'єкта(то.premium_animation),
  позиція_маски=ПозиціяМаски.створити_з_телеграм_об'єкта(то.mask_position),
  ідентифікатор_спеціального_емодзі=то.custom_emoji_id,
  розмір_файлу=то.file_size
) : пусто

дія Стікер.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    type=я.тип,
    width=я.ширина,
    height=я.висота,
    is_animated=я.є_анімованим,
    is_video=я.є_відео,
    thumb=я.мініатюра,
    emoji=я.емодзі,
    set_name=я.встановити_ім'я,
    premium_animation=я.преміум_анімація,
    mask_position=я.позиція_маски,
    custom_emoji_id=я.ідентифікатор_спеціального_емодзі,
    file_size=я.розмір_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НабірСтікерів
  назва текст
  назва текст
  тип_стікера текст
  є_анімованим логічне
  є_відео логічне
  стікери Список
  мініатюра РозмірФото
кінець

НабірСтікерів.створити_з_телеграм_об'єкта = (то): то ? НабірСтікерів(
  назва=то.name,
  назва=то.title,
  тип_стікера=то.sticker_type,
  є_анімованим=то.is_animated,
  є_відео=то.is_video,
  стікери=то.stickers,
  мініатюра=РозмірФото.створити_з_телеграм_об'єкта(то.thumb)
) : пусто

дія НабірСтікерів.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    name=я.назва,
    title=я.назва,
    sticker_type=я.тип_стікера,
    is_animated=я.є_анімованим,
    is_video=я.є_відео,
    stickers=я.стікери,
    thumb=я.мініатюра,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПозиціяМаски
  точка текст
  зсув_x число
  зсув_y число
  масштаб число
кінець

ПозиціяМаски.створити_з_телеграм_об'єкта = (то): то ? ПозиціяМаски(
  точка=то.point,
  зсув_x=то.x_shift,
  зсув_y=то.y_shift,
  масштаб=то.scale
) : пусто

дія ПозиціяМаски.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    point=я.точка,
    x_shift=я.зсув_x,
    y_shift=я.зсув_y,
    scale=я.масштаб,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВбудованийЗапит
  ідентифікатор текст
  від Користувач
  запит текст
  зсув текст
  тип_чату текст
  розташування Місцезнаходження
кінець

ВбудованийЗапит.створити_з_телеграм_об'єкта = (то): то ? ВбудованийЗапит(
  ідентифікатор=то.id,
  від=Користувач.створити_з_телеграм_об'єкта(то.from),
  запит=то.query,
  зсув=то.offset,
  тип_чату=то.chat_type,
  розташування=Місцезнаходження.створити_з_телеграм_об'єкта(то.location)
) : пусто

дія ВбудованийЗапит.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    id=я.ідентифікатор,
    from=я.від,
    query=я.запит,
    offset=я.зсув,
    chat_type=я.тип_чату,
    location=я.розташування,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапиту
кінець

РезультатВбудованогоЗапиту.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапиту() : пусто

дія РезультатВбудованогоЗапиту.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура РезультатВбудованогоЗапитуСтаття
  тип текст
  ідентифікатор текст
  назва текст
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
  розмітка_відповіді РозміткаІнлайнКлавіатури
  урл текст
  приховати_посилання логічне
  опис текст
  посилання_на_мініатюру текст
  ширина_мініатюри число
  висота_мініатюри число
кінець

РезультатВбудованогоЗапитуСтаття.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуСтаття(
  тип=то.type,
  ідентифікатор=то.id,
  назва=то.title,
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content),
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  урл=то.url,
  приховати_посилання=то.hide_url,
  опис=то.description,
  посилання_на_мініатюру=то.thumb_url,
  ширина_мініатюри=то.thumb_width,
  висота_мініатюри=то.thumb_height
) : пусто

дія РезультатВбудованогоЗапитуСтаття.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    title=я.назва,
    input_message_content=я.вхідний_контент_повідомлення,
    reply_markup=я.розмітка_відповіді,
    url=я.урл,
    hide_url=я.приховати_посилання,
    description=я.опис,
    thumb_url=я.посилання_на_мініатюру,
    thumb_width=я.ширина_мініатюри,
    thumb_height=я.висота_мініатюри,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуФото
  тип текст
  ідентифікатор текст
  посилання_на_фото текст
  посилання_на_мініатюру текст
  ширина_фото число
  висота_фото число
  назва текст
  опис текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

РезультатВбудованогоЗапитуФото.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуФото(
  тип=то.type,
  ідентифікатор=то.id,
  посилання_на_фото=то.photo_url,
  посилання_на_мініатюру=то.thumb_url,
  ширина_фото=то.photo_width,
  висота_фото=то.photo_height,
  назва=то.title,
  опис=то.description,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія РезультатВбудованогоЗапитуФото.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    photo_url=я.посилання_на_фото,
    thumb_url=я.посилання_на_мініатюру,
    photo_width=я.ширина_фото,
    photo_height=я.висота_фото,
    title=я.назва,
    description=я.опис,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуGIF
  тип текст
  ідентифікатор текст
  посилання_на_GIF текст
  ширина_GIF число
  висота_GIF число
  тривалість_GIF число
  посилання_на_мініатюру текст
  мімтип_мініатюри текст
  назва текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

РезультатВбудованогоЗапитуGIF.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуGIF(
  тип=то.type,
  ідентифікатор=то.id,
  посилання_на_GIF=то.gif_url,
  ширина_GIF=то.gif_width,
  висота_GIF=то.gif_height,
  тривалість_GIF=то.gif_duration,
  посилання_на_мініатюру=то.thumb_url,
  мімтип_мініатюри=то.thumb_mime_type,
  назва=то.title,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія РезультатВбудованогоЗапитуGIF.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    gif_url=я.посилання_на_GIF,
    gif_width=я.ширина_GIF,
    gif_height=я.висота_GIF,
    gif_duration=я.тривалість_GIF,
    thumb_url=я.посилання_на_мініатюру,
    thumb_mime_type=я.мімтип_мініатюри,
    title=я.назва,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуMPEG4GIF
  тип текст
  ідентифікатор текст
  посилання_на_MPEG4 текст
  ширина_MPEG4 число
  висота_MPEG4 число
  тривалість_MPEG4 число
  посилання_на_мініатюру текст
  мімтип_мініатюри текст
  назва текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

РезультатВбудованогоЗапитуMPEG4GIF.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуMPEG4GIF(
  тип=то.type,
  ідентифікатор=то.id,
  посилання_на_MPEG4=то.mpeg4_url,
  ширина_MPEG4=то.mpeg4_width,
  висота_MPEG4=то.mpeg4_height,
  тривалість_MPEG4=то.mpeg4_duration,
  посилання_на_мініатюру=то.thumb_url,
  мімтип_мініатюри=то.thumb_mime_type,
  назва=то.title,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія РезультатВбудованогоЗапитуMPEG4GIF.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    mpeg4_url=я.посилання_на_MPEG4,
    mpeg4_width=я.ширина_MPEG4,
    mpeg4_height=я.висота_MPEG4,
    mpeg4_duration=я.тривалість_MPEG4,
    thumb_url=я.посилання_на_мініатюру,
    thumb_mime_type=я.мімтип_мініатюри,
    title=я.назва,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуВідео
  тип текст
  ідентифікатор текст
  посилання_на_відео текст
  мімтип текст
  посилання_на_мініатюру текст
  назва текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  ширина_відео число
  висота_відео число
  тривалість_відео число
  опис текст
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

РезультатВбудованогоЗапитуВідео.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуВідео(
  тип=то.type,
  ідентифікатор=то.id,
  посилання_на_відео=то.video_url,
  мімтип=то.mime_type,
  посилання_на_мініатюру=то.thumb_url,
  назва=то.title,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  ширина_відео=то.video_width,
  висота_відео=то.video_height,
  тривалість_відео=то.video_duration,
  опис=то.description,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія РезультатВбудованогоЗапитуВідео.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    video_url=я.посилання_на_відео,
    mime_type=я.мімтип,
    thumb_url=я.посилання_на_мініатюру,
    title=я.назва,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    video_width=я.ширина_відео,
    video_height=я.висота_відео,
    video_duration=я.тривалість_відео,
    description=я.опис,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуАудіо
  тип текст
  ідентифікатор текст
  посилання_на_аудіо текст
  назва текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  виконавець текст
  тривалість_аудіо число
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

РезультатВбудованогоЗапитуАудіо.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуАудіо(
  тип=то.type,
  ідентифікатор=то.id,
  посилання_на_аудіо=то.audio_url,
  назва=то.title,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  виконавець=то.performer,
  тривалість_аудіо=то.audio_duration,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія РезультатВбудованогоЗапитуАудіо.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    audio_url=я.посилання_на_аудіо,
    title=я.назва,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    performer=я.виконавець,
    audio_duration=я.тривалість_аудіо,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуГолос
  тип текст
  ідентифікатор текст
  посилання_на_голосове_повідомлення текст
  назва текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  тривалість_голосового_повідомлення число
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

РезультатВбудованогоЗапитуГолос.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуГолос(
  тип=то.type,
  ідентифікатор=то.id,
  посилання_на_голосове_повідомлення=то.voice_url,
  назва=то.title,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  тривалість_голосового_повідомлення=то.voice_duration,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія РезультатВбудованогоЗапитуГолос.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    voice_url=я.посилання_на_голосове_повідомлення,
    title=я.назва,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    voice_duration=я.тривалість_голосового_повідомлення,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуДокумент
  тип текст
  ідентифікатор текст
  назва текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  посилання_на_документ текст
  мімтип текст
  опис текст
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
  посилання_на_мініатюру текст
  ширина_мініатюри число
  висота_мініатюри число
кінець

РезультатВбудованогоЗапитуДокумент.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуДокумент(
  тип=то.type,
  ідентифікатор=то.id,
  назва=то.title,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  посилання_на_документ=то.document_url,
  мімтип=то.mime_type,
  опис=то.description,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content),
  посилання_на_мініатюру=то.thumb_url,
  ширина_мініатюри=то.thumb_width,
  висота_мініатюри=то.thumb_height
) : пусто

дія РезультатВбудованогоЗапитуДокумент.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    title=я.назва,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    document_url=я.посилання_на_документ,
    mime_type=я.мімтип,
    description=я.опис,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    thumb_url=я.посилання_на_мініатюру,
    thumb_width=я.ширина_мініатюри,
    thumb_height=я.висота_мініатюри,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуМісцезнаходження
  тип текст
  ідентифікатор текст
  широта число
  довгота число
  назва текст
  горизонтальна_точність число
  активний_період число
  напрямок число
  радіус_сповіщення число
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
  посилання_на_мініатюру текст
  ширина_мініатюри число
  висота_мініатюри число
кінець

РезультатВбудованогоЗапитуМісцезнаходження.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуМісцезнаходження(
  тип=то.type,
  ідентифікатор=то.id,
  широта=то.latitude,
  довгота=то.longitude,
  назва=то.title,
  горизонтальна_точність=то.horizontal_accuracy,
  активний_період=то.live_period,
  напрямок=то.heading,
  радіус_сповіщення=то.proximity_alert_radius,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content),
  посилання_на_мініатюру=то.thumb_url,
  ширина_мініатюри=то.thumb_width,
  висота_мініатюри=то.thumb_height
) : пусто

дія РезультатВбудованогоЗапитуМісцезнаходження.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    latitude=я.широта,
    longitude=я.довгота,
    title=я.назва,
    horizontal_accuracy=я.горизонтальна_точність,
    live_period=я.активний_період,
    heading=я.напрямок,
    proximity_alert_radius=я.радіус_сповіщення,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    thumb_url=я.посилання_на_мініатюру,
    thumb_width=я.ширина_мініатюри,
    thumb_height=я.висота_мініатюри,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуЗаклад
  тип текст
  ідентифікатор текст
  широта число
  довгота число
  назва текст
  адреса текст
  ідентифікатор_Foursquare текст
  тип_Foursquare текст
  ідентифікатор_Google текст
  тип_Google текст
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
  посилання_на_мініатюру текст
  ширина_мініатюри число
  висота_мініатюри число
кінець

РезультатВбудованогоЗапитуЗаклад.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуЗаклад(
  тип=то.type,
  ідентифікатор=то.id,
  широта=то.latitude,
  довгота=то.longitude,
  назва=то.title,
  адреса=то.address,
  ідентифікатор_Foursquare=то.foursquare_id,
  тип_Foursquare=то.foursquare_type,
  ідентифікатор_Google=то.google_place_id,
  тип_Google=то.google_place_type,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content),
  посилання_на_мініатюру=то.thumb_url,
  ширина_мініатюри=то.thumb_width,
  висота_мініатюри=то.thumb_height
) : пусто

дія РезультатВбудованогоЗапитуЗаклад.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    latitude=я.широта,
    longitude=я.довгота,
    title=я.назва,
    address=я.адреса,
    foursquare_id=я.ідентифікатор_Foursquare,
    foursquare_type=я.тип_Foursquare,
    google_place_id=я.ідентифікатор_Google,
    google_place_type=я.тип_Google,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    thumb_url=я.посилання_на_мініатюру,
    thumb_width=я.ширина_мініатюри,
    thumb_height=я.висота_мініатюри,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуКонтакт
  тип текст
  ідентифікатор текст
  номер_телефону текст
  ім'я текст
  прізвище текст
  візитна_картка текст
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
  посилання_на_мініатюру текст
  ширина_мініатюри число
  висота_мініатюри число
кінець

РезультатВбудованогоЗапитуКонтакт.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуКонтакт(
  тип=то.type,
  ідентифікатор=то.id,
  номер_телефону=то.phone_number,
  ім'я=то.first_name,
  прізвище=то.last_name,
  візитна_картка=то.vcard,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content),
  посилання_на_мініатюру=то.thumb_url,
  ширина_мініатюри=то.thumb_width,
  висота_мініатюри=то.thumb_height
) : пусто

дія РезультатВбудованогоЗапитуКонтакт.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    phone_number=я.номер_телефону,
    first_name=я.ім'я,
    last_name=я.прізвище,
    vcard=я.візитна_картка,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    thumb_url=я.посилання_на_мініатюру,
    thumb_width=я.ширина_мініатюри,
    thumb_height=я.висота_мініатюри,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РезультатВбудованогоЗапитуГра
  тип текст
  ідентифікатор текст
  коротке_ім'я_гри текст
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

РезультатВбудованогоЗапитуГра.створити_з_телеграм_об'єкта = (то): то ? РезультатВбудованогоЗапитуГра(
  тип=то.type,
  ідентифікатор=то.id,
  коротке_ім'я_гри=то.game_short_name,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup)
) : пусто

дія РезультатВбудованогоЗапитуГра.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    game_short_name=я.коротке_ім'я_гри,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗбереженийРезультатВбудованогоЗапитуФото
  тип текст
  ідентифікатор текст
  ідентифікатор_файлу_фото текст
  назва текст
  опис текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

ЗбереженийРезультатВбудованогоЗапитуФото.створити_з_телеграм_об'єкта = (то): то ? ЗбереженийРезультатВбудованогоЗапитуФото(
  тип=то.type,
  ідентифікатор=то.id,
  ідентифікатор_файлу_фото=то.photo_file_id,
  назва=то.title,
  опис=то.description,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія ЗбереженийРезультатВбудованогоЗапитуФото.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    photo_file_id=я.ідентифікатор_файлу_фото,
    title=я.назва,
    description=я.опис,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗбереженийРезультатВбудованогоЗапитуГіф
  тип текст
  ідентифікатор текст
  ідентифікатор_файлу_GIF текст
  назва текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

ЗбереженийРезультатВбудованогоЗапитуГіф.створити_з_телеграм_об'єкта = (то): то ? ЗбереженийРезультатВбудованогоЗапитуГіф(
  тип=то.type,
  ідентифікатор=то.id,
  ідентифікатор_файлу_GIF=то.gif_file_id,
  назва=то.title,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія ЗбереженийРезультатВбудованогоЗапитуГіф.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    gif_file_id=я.ідентифікатор_файлу_GIF,
    title=я.назва,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗбереженийРезультатВбудованогоЗапитуМпег4Гіф
  тип текст
  ідентифікатор текст
  ідентифікатор_файлу_MPEG4 текст
  назва текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

ЗбереженийРезультатВбудованогоЗапитуМпег4Гіф.створити_з_телеграм_об'єкта = (то): то ? ЗбереженийРезультатВбудованогоЗапитуМпег4Гіф(
  тип=то.type,
  ідентифікатор=то.id,
  ідентифікатор_файлу_MPEG4=то.mpeg4_file_id,
  назва=то.title,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія ЗбереженийРезультатВбудованогоЗапитуМпег4Гіф.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    mpeg4_file_id=я.ідентифікатор_файлу_MPEG4,
    title=я.назва,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КешованийРезультатПошукуСтікера
  тип текст
  ідентифікатор текст
  ідентифікатор_файлу_стікера текст
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

КешованийРезультатПошукуСтікера.створити_з_телеграм_об'єкта = (то): то ? КешованийРезультатПошукуСтікера(
  тип=то.type,
  ідентифікатор=то.id,
  ідентифікатор_файлу_стікера=то.sticker_file_id,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія КешованийРезультатПошукуСтікера.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    sticker_file_id=я.ідентифікатор_файлу_стікера,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КешованийРезультатПошукуДокумента
  тип текст
  ідентифікатор текст
  назва текст
  ідентифікатор_файлу_документа текст
  опис текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

КешованийРезультатПошукуДокумента.створити_з_телеграм_об'єкта = (то): то ? КешованийРезультатПошукуДокумента(
  тип=то.type,
  ідентифікатор=то.id,
  назва=то.title,
  ідентифікатор_файлу_документа=то.document_file_id,
  опис=то.description,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія КешованийРезультатПошукуДокумента.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    title=я.назва,
    document_file_id=я.ідентифікатор_файлу_документа,
    description=я.опис,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КешованийРезультатПошукуВідео
  тип текст
  ідентифікатор текст
  ідентифікатор_файлу_відео текст
  назва текст
  опис текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

КешованийРезультатПошукуВідео.створити_з_телеграм_об'єкта = (то): то ? КешованийРезультатПошукуВідео(
  тип=то.type,
  ідентифікатор=то.id,
  ідентифікатор_файлу_відео=то.video_file_id,
  назва=то.title,
  опис=то.description,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія КешованийРезультатПошукуВідео.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    video_file_id=я.ідентифікатор_файлу_відео,
    title=я.назва,
    description=я.опис,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КешованийРезультатПошукуГолосу
  тип текст
  ідентифікатор текст
  ідентифікатор_файлу_голосового_повідомлення текст
  назва текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

КешованийРезультатПошукуГолосу.створити_з_телеграм_об'єкта = (то): то ? КешованийРезультатПошукуГолосу(
  тип=то.type,
  ідентифікатор=то.id,
  ідентифікатор_файлу_голосового_повідомлення=то.voice_file_id,
  назва=то.title,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія КешованийРезультатПошукуГолосу.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    voice_file_id=я.ідентифікатор_файлу_голосового_повідомлення,
    title=я.назва,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КешованийРезультатПошукуАудіо
  тип текст
  ідентифікатор текст
  ідентифікатор_файлу_аудіо текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
  вхідний_контент_повідомлення ВмістВведенняПовідомлення
кінець

КешованийРезультатПошукуАудіо.створити_з_телеграм_об'єкта = (то): то ? КешованийРезультатПошукуАудіо(
  тип=то.type,
  ідентифікатор=то.id,
  ідентифікатор_файлу_аудіо=то.audio_file_id,
  підпис=то.caption,
  режим_розбору=то.parse_mode,
  сутності_підпису=то.caption_entities,
  розмітка_відповіді=РозміткаІнлайнКлавіатури.створити_з_телеграм_об'єкта(то.reply_markup),
  вхідний_контент_повідомлення=ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта(то.input_message_content)
) : пусто

дія КешованийРезультатПошукуАудіо.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    id=я.ідентифікатор,
    audio_file_id=я.ідентифікатор_файлу_аудіо,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    input_message_content=я.вхідний_контент_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВмістВведенняПовідомлення
кінець

ВмістВведенняПовідомлення.створити_з_телеграм_об'єкта = (то): то ? ВмістВведенняПовідомлення() : пусто

дія ВмістВведенняПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура ВмістВведенняТекстовогоПовідомлення
  текст_повідомлення текст
  режим_розбору текст
  сутності Список
  вимкнути_попередній_перегляд_сторінки логічне
кінець

ВмістВведенняТекстовогоПовідомлення.створити_з_телеграм_об'єкта = (то): то ? ВмістВведенняТекстовогоПовідомлення(
  текст_повідомлення=то.message_text,
  режим_розбору=то.parse_mode,
  сутності=то.entities,
  вимкнути_попередній_перегляд_сторінки=то.disable_web_page_preview
) : пусто

дія ВмістВведенняТекстовогоПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    message_text=я.текст_повідомлення,
    parse_mode=я.режим_розбору,
    entities=я.сутності,
    disable_web_page_preview=я.вимкнути_попередній_перегляд_сторінки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВмістВведенняПовідомленняПроМісцезнаходження
  широта число
  довгота число
  горизонтальна_точність число
  активний_період число
  напрямок число
  радіус_сповіщення число
кінець

ВмістВведенняПовідомленняПроМісцезнаходження.створити_з_телеграм_об'єкта = (то): то ? ВмістВведенняПовідомленняПроМісцезнаходження(
  широта=то.latitude,
  довгота=то.longitude,
  горизонтальна_точність=то.horizontal_accuracy,
  активний_період=то.live_period,
  напрямок=то.heading,
  радіус_сповіщення=то.proximity_alert_radius
) : пусто

дія ВмістВведенняПовідомленняПроМісцезнаходження.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    latitude=я.широта,
    longitude=я.довгота,
    horizontal_accuracy=я.горизонтальна_точність,
    live_period=я.активний_період,
    heading=я.напрямок,
    proximity_alert_radius=я.радіус_сповіщення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВмістВведенняПовідомленняПроМісце
  широта число
  довгота число
  назва текст
  адреса текст
  ідентифікатор_Foursquare текст
  тип_Foursquare текст
  ідентифікатор_Google текст
  тип_Google текст
кінець

ВмістВведенняПовідомленняПроМісце.створити_з_телеграм_об'єкта = (то): то ? ВмістВведенняПовідомленняПроМісце(
  широта=то.latitude,
  довгота=то.longitude,
  назва=то.title,
  адреса=то.address,
  ідентифікатор_Foursquare=то.foursquare_id,
  тип_Foursquare=то.foursquare_type,
  ідентифікатор_Google=то.google_place_id,
  тип_Google=то.google_place_type
) : пусто

дія ВмістВведенняПовідомленняПроМісце.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    latitude=я.широта,
    longitude=я.довгота,
    title=я.назва,
    address=я.адреса,
    foursquare_id=я.ідентифікатор_Foursquare,
    foursquare_type=я.тип_Foursquare,
    google_place_id=я.ідентифікатор_Google,
    google_place_type=я.тип_Google,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВмістВведенняПовідомленняПроКонтакт
  номер_телефону текст
  ім'я текст
  прізвище текст
  візитна_картка текст
кінець

ВмістВведенняПовідомленняПроКонтакт.створити_з_телеграм_об'єкта = (то): то ? ВмістВведенняПовідомленняПроКонтакт(
  номер_телефону=то.phone_number,
  ім'я=то.first_name,
  прізвище=то.last_name,
  візитна_картка=то.vcard
) : пусто

дія ВмістВведенняПовідомленняПроКонтакт.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    phone_number=я.номер_телефону,
    first_name=я.ім'я,
    last_name=я.прізвище,
    vcard=я.візитна_картка,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВмістВведенняПовідомленняПроРахунок
  назва текст
  опис текст
  підзаголовок текст
  токен_провайдера текст
  валюта текст
  ціни Список
  максимальна_сума_чайових число
  рекомендовані_суми_чайових Список
  дані_провайдера текст
  посилання_на_фото текст
  розмір_фото число
  ширина_фото число
  висота_фото число
  потрібне_ім'я логічне
  потрібен_номер_телефону логічне
  потрібна_електронна_адреса логічне
  потрібна_адреса_доставки логічне
  надіслати_номер_телефону_провайдеру логічне
  надіслати_електронну_адресу_провайдеру логічне
  гнучкість логічне
кінець

ВмістВведенняПовідомленняПроРахунок.створити_з_телеграм_об'єкта = (то): то ? ВмістВведенняПовідомленняПроРахунок(
  назва=то.title,
  опис=то.description,
  підзаголовок=то.payload,
  токен_провайдера=то.provider_token,
  валюта=то.currency,
  ціни=то.prices,
  максимальна_сума_чайових=то.max_tip_amount,
  рекомендовані_суми_чайових=то.suggested_tip_amounts,
  дані_провайдера=то.provider_data,
  посилання_на_фото=то.photo_url,
  розмір_фото=то.photo_size,
  ширина_фото=то.photo_width,
  висота_фото=то.photo_height,
  потрібне_ім'я=то.need_name,
  потрібен_номер_телефону=то.need_phone_number,
  потрібна_електронна_адреса=то.need_email,
  потрібна_адреса_доставки=то.need_shipping_address,
  надіслати_номер_телефону_провайдеру=то.send_phone_number_to_provider,
  надіслати_електронну_адресу_провайдеру=то.send_email_to_provider,
  гнучкість=то.is_flexible
) : пусто

дія ВмістВведенняПовідомленняПроРахунок.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    title=я.назва,
    description=я.опис,
    payload=я.підзаголовок,
    provider_token=я.токен_провайдера,
    currency=я.валюта,
    prices=я.ціни,
    max_tip_amount=я.максимальна_сума_чайових,
    suggested_tip_amounts=я.рекомендовані_суми_чайових,
    provider_data=я.дані_провайдера,
    photo_url=я.посилання_на_фото,
    photo_size=я.розмір_фото,
    photo_width=я.ширина_фото,
    photo_height=я.висота_фото,
    need_name=я.потрібне_ім'я,
    need_phone_number=я.потрібен_номер_телефону,
    need_email=я.потрібна_електронна_адреса,
    need_shipping_address=я.потрібна_адреса_доставки,
    send_phone_number_to_provider=я.надіслати_номер_телефону_провайдеру,
    send_email_to_provider=я.надіслати_електронну_адресу_провайдеру,
    is_flexible=я.гнучкість,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВибранийРезультатПошукуПозастроками
  ідентифікатор_результату текст
  від Користувач
  розташування Місцезнаходження
  ідентифікатор_інлайн_повідомлення текст
  запит текст
кінець

ВибранийРезультатПошукуПозастроками.створити_з_телеграм_об'єкта = (то): то ? ВибранийРезультатПошукуПозастроками(
  ідентифікатор_результату=то.result_id,
  від=Користувач.створити_з_телеграм_об'єкта(то.from),
  розташування=Місцезнаходження.створити_з_телеграм_об'єкта(то.location),
  ідентифікатор_інлайн_повідомлення=то.inline_message_id,
  запит=то.query
) : пусто

дія ВибранийРезультатПошукуПозастроками.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    result_id=я.ідентифікатор_результату,
    from=я.від,
    location=я.розташування,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    query=я.запит,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідправленоПовідомленняВебДодатку
  ідентифікатор_інлайн_повідомлення текст
кінець

ВідправленоПовідомленняВебДодатку.створити_з_телеграм_об'єкта = (то): то ? ВідправленоПовідомленняВебДодатку(
  ідентифікатор_інлайн_повідомлення=то.inline_message_id
) : пусто

дія ВідправленоПовідомленняВебДодатку.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПозначенаЦіна
  мітка текст
  сума число
кінець

ПозначенаЦіна.створити_з_телеграм_об'єкта = (то): то ? ПозначенаЦіна(
  мітка=то.label,
  сума=то.amount
) : пусто

дія ПозначенаЦіна.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    label=я.мітка,
    amount=я.сума,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Рахунок
  назва текст
  опис текст
  початковий_параметр текст
  валюта текст
  загальна_сума число
кінець

Рахунок.створити_з_телеграм_об'єкта = (то): то ? Рахунок(
  назва=то.title,
  опис=то.description,
  початковий_параметр=то.start_parameter,
  валюта=то.currency,
  загальна_сума=то.total_amount
) : пусто

дія Рахунок.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    title=я.назва,
    description=я.опис,
    start_parameter=я.початковий_параметр,
    currency=я.валюта,
    total_amount=я.загальна_сума,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура АдресаДоставки
  код_країни текст
  область текст
  місто текст
  вулиця_1 текст
  вулиця_2 текст
  поштовий_індекс текст
кінець

АдресаДоставки.створити_з_телеграм_об'єкта = (то): то ? АдресаДоставки(
  код_країни=то.country_code,
  область=то.state,
  місто=то.city,
  вулиця_1=то.street_line1,
  вулиця_2=то.street_line2,
  поштовий_індекс=то.post_code
) : пусто

дія АдресаДоставки.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    country_code=я.код_країни,
    state=я.область,
    city=я.місто,
    street_line1=я.вулиця_1,
    street_line2=я.вулиця_2,
    post_code=я.поштовий_індекс,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ІнформаціяПроЗамовлення
  назва текст
  номер_телефону текст
  електронна_адреса текст
  адреса_доставки АдресаДоставки
кінець

ІнформаціяПроЗамовлення.створити_з_телеграм_об'єкта = (то): то ? ІнформаціяПроЗамовлення(
  назва=то.name,
  номер_телефону=то.phone_number,
  електронна_адреса=то.email,
  адреса_доставки=АдресаДоставки.створити_з_телеграм_об'єкта(то.shipping_address)
) : пусто

дія ІнформаціяПроЗамовлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    name=я.назва,
    phone_number=я.номер_телефону,
    email=я.електронна_адреса,
    shipping_address=я.адреса_доставки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВаріантДоставки
  ідентифікатор текст
  назва текст
  ціни Список
кінець

ВаріантДоставки.створити_з_телеграм_об'єкта = (то): то ? ВаріантДоставки(
  ідентифікатор=то.id,
  назва=то.title,
  ціни=то.prices
) : пусто

дія ВаріантДоставки.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    id=я.ідентифікатор,
    title=я.назва,
    prices=я.ціни,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура УспішнаОплата
  валюта текст
  загальна_сума число
  інформація_про_рахунок текст
  ідентифікатор_опції_доставки текст
  інформація_про_замовлення ІнформаціяПроЗамовлення
  ідентифікатор_оплати_в_Telegram текст
  ідентифікатор_оплати_провайдера текст
кінець

УспішнаОплата.створити_з_телеграм_об'єкта = (то): то ? УспішнаОплата(
  валюта=то.currency,
  загальна_сума=то.total_amount,
  інформація_про_рахунок=то.invoice_payload,
  ідентифікатор_опції_доставки=то.shipping_option_id,
  інформація_про_замовлення=ІнформаціяПроЗамовлення.створити_з_телеграм_об'єкта(то.order_info),
  ідентифікатор_оплати_в_Telegram=то.telegram_payment_charge_id,
  ідентифікатор_оплати_провайдера=то.provider_payment_charge_id
) : пусто

дія УспішнаОплата.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    currency=я.валюта,
    total_amount=я.загальна_сума,
    invoice_payload=я.інформація_про_рахунок,
    shipping_option_id=я.ідентифікатор_опції_доставки,
    order_info=я.інформація_про_замовлення,
    telegram_payment_charge_id=я.ідентифікатор_оплати_в_Telegram,
    provider_payment_charge_id=я.ідентифікатор_оплати_провайдера,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗапитДоставки
  ідентифікатор текст
  від Користувач
  інформація_про_рахунок текст
  адреса_доставки АдресаДоставки
кінець

ЗапитДоставки.створити_з_телеграм_об'єкта = (то): то ? ЗапитДоставки(
  ідентифікатор=то.id,
  від=Користувач.створити_з_телеграм_об'єкта(то.from),
  інформація_про_рахунок=то.invoice_payload,
  адреса_доставки=АдресаДоставки.створити_з_телеграм_об'єкта(то.shipping_address)
) : пусто

дія ЗапитДоставки.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    id=я.ідентифікатор,
    from=я.від,
    invoice_payload=я.інформація_про_рахунок,
    shipping_address=я.адреса_доставки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗапитНапередВідшкодування
  ідентифікатор текст
  від Користувач
  валюта текст
  загальна_сума число
  інформація_про_рахунок текст
  ідентифікатор_опції_доставки текст
  інформація_про_замовлення ІнформаціяПроЗамовлення
кінець

ЗапитНапередВідшкодування.створити_з_телеграм_об'єкта = (то): то ? ЗапитНапередВідшкодування(
  ідентифікатор=то.id,
  від=Користувач.створити_з_телеграм_об'єкта(то.from),
  валюта=то.currency,
  загальна_сума=то.total_amount,
  інформація_про_рахунок=то.invoice_payload,
  ідентифікатор_опції_доставки=то.shipping_option_id,
  інформація_про_замовлення=ІнформаціяПроЗамовлення.створити_з_телеграм_об'єкта(то.order_info)
) : пусто

дія ЗапитНапередВідшкодування.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    id=я.ідентифікатор,
    from=я.від,
    currency=я.валюта,
    total_amount=я.загальна_сума,
    invoice_payload=я.інформація_про_рахунок,
    shipping_option_id=я.ідентифікатор_опції_доставки,
    order_info=я.інформація_про_замовлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ДаніПаспорта
  дані Список
  ідентифікаційні_дані ЗашифрованіОбліковіДані
кінець

ДаніПаспорта.створити_з_телеграм_об'єкта = (то): то ? ДаніПаспорта(
  дані=то.data,
  ідентифікаційні_дані=ЗашифрованіОбліковіДані.створити_з_телеграм_об'єкта(то.credentials)
) : пусто

дія ДаніПаспорта.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    data=я.дані,
    credentials=я.ідентифікаційні_дані,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ФайлПаспорта
  ідентифікатор_файлу текст
  унікальний_ідентифікатор_файлу текст
  розмір_файлу число
  дата_файлу число
кінець

ФайлПаспорта.створити_з_телеграм_об'єкта = (то): то ? ФайлПаспорта(
  ідентифікатор_файлу=то.file_id,
  унікальний_ідентифікатор_файлу=то.file_unique_id,
  розмір_файлу=то.file_size,
  дата_файлу=то.file_date
) : пусто

дія ФайлПаспорта.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    file_unique_id=я.унікальний_ідентифікатор_файлу,
    file_size=я.розмір_файлу,
    file_date=я.дата_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗашифрованийЕлементПаспорта
  тип текст
  дані текст
  номер_телефону текст
  електронна_адреса текст
  файли Список
  фронтальна_сторона ФайлПаспорта
  зворотна_сторона ФайлПаспорта
  селфі ФайлПаспорта
  переклад Список
  хеш текст
кінець

ЗашифрованийЕлементПаспорта.створити_з_телеграм_об'єкта = (то): то ? ЗашифрованийЕлементПаспорта(
  тип=то.type,
  дані=то.data,
  номер_телефону=то.phone_number,
  електронна_адреса=то.email,
  файли=то.files,
  фронтальна_сторона=ФайлПаспорта.створити_з_телеграм_об'єкта(то.front_side),
  зворотна_сторона=ФайлПаспорта.створити_з_телеграм_об'єкта(то.reverse_side),
  селфі=ФайлПаспорта.створити_з_телеграм_об'єкта(то.selfie),
  переклад=то.translation,
  хеш=то.hash
) : пусто

дія ЗашифрованийЕлементПаспорта.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    type=я.тип,
    data=я.дані,
    phone_number=я.номер_телефону,
    email=я.електронна_адреса,
    files=я.файли,
    front_side=я.фронтальна_сторона,
    reverse_side=я.зворотна_сторона,
    selfie=я.селфі,
    translation=я.переклад,
    hash=я.хеш,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗашифрованіОбліковіДані
  дані текст
  хеш текст
  секрет текст
кінець

ЗашифрованіОбліковіДані.створити_з_телеграм_об'єкта = (то): то ? ЗашифрованіОбліковіДані(
  дані=то.data,
  хеш=то.hash,
  секрет=то.secret
) : пусто

дія ЗашифрованіОбліковіДані.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    data=я.дані,
    hash=я.хеш,
    secret=я.секрет,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПомилкаЕлементуПаспорту
кінець

ПомилкаЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? ПомилкаЕлементуПаспорту() : пусто

дія ПомилкаЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура ПомилкаДанихЕлементуПаспорту
  джерело текст
  тип текст
  ім'я_поля текст
  хеш_даних текст
  повідомлення текст
кінець

ПомилкаДанихЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? ПомилкаДанихЕлементуПаспорту(
  джерело=то.source,
  тип=то.type,
  ім'я_поля=то.field_name,
  хеш_даних=то.data_hash,
  повідомлення=то.message
) : пусто

дія ПомилкаДанихЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    source=я.джерело,
    type=я.тип,
    field_name=я.ім'я_поля,
    data_hash=я.хеш_даних,
    message=я.повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПомилкаПередньоїСторониЕлементуПаспорту
  джерело текст
  тип текст
  хеш_файлу текст
  повідомлення текст
кінець

ПомилкаПередньоїСторониЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? ПомилкаПередньоїСторониЕлементуПаспорту(
  джерело=то.source,
  тип=то.type,
  хеш_файлу=то.file_hash,
  повідомлення=то.message
) : пусто

дія ПомилкаПередньоїСторониЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    source=я.джерело,
    type=я.тип,
    file_hash=я.хеш_файлу,
    message=я.повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПомилкаЗворотньоїСторониЕлементуПаспорту
  джерело текст
  тип текст
  хеш_файлу текст
  повідомлення текст
кінець

ПомилкаЗворотньоїСторониЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? ПомилкаЗворотньоїСторониЕлементуПаспорту(
  джерело=то.source,
  тип=то.type,
  хеш_файлу=то.file_hash,
  повідомлення=то.message
) : пусто

дія ПомилкаЗворотньоїСторониЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    source=я.джерело,
    type=я.тип,
    file_hash=я.хеш_файлу,
    message=я.повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПомилкаСелфіЕлементуПаспорту
  джерело текст
  тип текст
  хеш_файлу текст
  повідомлення текст
кінець

ПомилкаСелфіЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? ПомилкаСелфіЕлементуПаспорту(
  джерело=то.source,
  тип=то.type,
  хеш_файлу=то.file_hash,
  повідомлення=то.message
) : пусто

дія ПомилкаСелфіЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    source=я.джерело,
    type=я.тип,
    file_hash=я.хеш_файлу,
    message=я.повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПомилкаФайлуЕлементуПаспорту
  джерело текст
  тип текст
  хеш_файлу текст
  повідомлення текст
кінець

ПомилкаФайлуЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? ПомилкаФайлуЕлементуПаспорту(
  джерело=то.source,
  тип=то.type,
  хеш_файлу=то.file_hash,
  повідомлення=то.message
) : пусто

дія ПомилкаФайлуЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    source=я.джерело,
    type=я.тип,
    file_hash=я.хеш_файлу,
    message=я.повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПомилкаФайлівЕлементуПаспорту
  джерело текст
  тип текст
  хеші_файлів Список
  повідомлення текст
кінець

ПомилкаФайлівЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? ПомилкаФайлівЕлементуПаспорту(
  джерело=то.source,
  тип=то.type,
  хеші_файлів=то.file_hashes,
  повідомлення=то.message
) : пусто

дія ПомилкаФайлівЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    source=я.джерело,
    type=я.тип,
    file_hashes=я.хеші_файлів,
    message=я.повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПомилкаФайлуПерекладуЕлементуПаспорту
  джерело текст
  тип текст
  хеш_файлу текст
  повідомлення текст
кінець

ПомилкаФайлуПерекладуЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? ПомилкаФайлуПерекладуЕлементуПаспорту(
  джерело=то.source,
  тип=то.type,
  хеш_файлу=то.file_hash,
  повідомлення=то.message
) : пусто

дія ПомилкаФайлуПерекладуЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    source=я.джерело,
    type=я.тип,
    file_hash=я.хеш_файлу,
    message=я.повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПомилкаФайлівПерекладуЕлементуПаспорту
  джерело текст
  тип текст
  хеші_файлів Список
  повідомлення текст
кінець

ПомилкаФайлівПерекладуЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? ПомилкаФайлівПерекладуЕлементуПаспорту(
  джерело=то.source,
  тип=то.type,
  хеші_файлів=то.file_hashes,
  повідомлення=то.message
) : пусто

дія ПомилкаФайлівПерекладуЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    source=я.джерело,
    type=я.тип,
    file_hashes=я.хеші_файлів,
    message=я.повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НевизначенаПомилкаЕлементуПаспорту
  джерело текст
  тип текст
  хеш_елемента текст
  повідомлення текст
кінець

НевизначенаПомилкаЕлементуПаспорту.створити_з_телеграм_об'єкта = (то): то ? НевизначенаПомилкаЕлементуПаспорту(
  джерело=то.source,
  тип=то.type,
  хеш_елемента=то.element_hash,
  повідомлення=то.message
) : пусто

дія НевизначенаПомилкаЕлементуПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    source=я.джерело,
    type=я.тип,
    element_hash=я.хеш_елемента,
    message=я.повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура Гра
  назва текст
  опис текст
  фото Список
  текст текст
  текстові_ентіті Список
  анімація Анімація
кінець

Гра.створити_з_телеграм_об'єкта = (то): то ? Гра(
  назва=то.title,
  опис=то.description,
  фото=то.photo,
  текст=то.text,
  текстові_ентіті=то.text_entities,
  анімація=Анімація.створити_з_телеграм_об'єкта(то.animation)
) : пусто

дія Гра.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    title=я.назва,
    description=я.опис,
    photo=я.фото,
    text=я.текст,
    text_entities=я.текстові_ентіті,
    animation=я.анімація,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗворотнійВикликГра
кінець

ЗворотнійВикликГра.створити_з_телеграм_об'єкта = (то): то ? ЗворотнійВикликГра() : пусто

дія ЗворотнійВикликГра.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура РекордУГрі
  позиція число
  користувач Користувач
  оцінка число
кінець

РекордУГрі.створити_з_телеграм_об'єкта = (то): то ? РекордУГрі(
  позиція=то.position,
  користувач=Користувач.створити_з_телеграм_об'єкта(то.user),
  оцінка=то.score
) : пусто

дія РекордУГрі.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    position=я.позиція,
    user=я.користувач,
    score=я.оцінка,
    __оминати_пустоту_конвертуючи__=так
  )
кінець
`;

const methodsModuleCode = `
структура ОтриматиОновлення
  зсув число
  ліміт число
  таймаут число
  дозволені_оновлення Список
кінець

дія ОтриматиОновлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    offset=я.зсув,
    limit=я.ліміт,
    timeout=я.таймаут,
    allowed_updates=я.дозволені_оновлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиВебхук
  урл текст
  сертифікат ВвідФайлу
  інтернет_адреса текст
  максимальна_кількість_з'єднань число
  дозволені_оновлення Список
  видалити_очікуючі_оновлення логічне
  секретний_токен текст
кінець

дія ВстановитиВебхук.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    url=я.урл,
    certificate=я.сертифікат,
    ip_address=я.інтернет_адреса,
    max_connections=я.максимальна_кількість_з'єднань,
    allowed_updates=я.дозволені_оновлення,
    drop_pending_updates=я.видалити_очікуючі_оновлення,
    secret_token=я.секретний_токен,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВидалитиВебхук
  видалити_очікуючі_оновлення логічне
кінець

дія ВидалитиВебхук.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    drop_pending_updates=я.видалити_очікуючі_оновлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиІнформаціюВебхука
кінець

дія ОтриматиІнформаціюВебхука.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура ОтриматиСебе
кінець

дія ОтриматиСебе.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура Вийти
кінець

дія Вийти.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура Закрити
кінець

дія Закрити.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура НадіслатиПовідомлення
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  текст текст
  режим_розбору текст
  сутності Список
  вимкнути_попередній_перегляд_сторінки логічне
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    text=я.текст,
    parse_mode=я.режим_розбору,
    entities=я.сутності,
    disable_web_page_preview=я.вимкнути_попередній_перегляд_сторінки,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПереслатиПовідомлення
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  від_ід_чату число
  відключити_сповіщення логічне
  захист_вмісту логічне
  ідентифікатор_повідомлення число
кінець

дія ПереслатиПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    from_chat_id=я.від_ід_чату,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    message_id=я.ідентифікатор_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура КопіюватиПовідомлення
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  від_ід_чату число
  ідентифікатор_повідомлення число
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія КопіюватиПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    from_chat_id=я.від_ід_чату,
    message_id=я.ідентифікатор_повідомлення,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиФото
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  фото ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  має_спойлер логічне
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиФото.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    photo=я.фото,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    has_spoiler=я.має_спойлер,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиАудіо
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  аудіо ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  тривалість число
  виконавець текст
  назва текст
  мініатюра ВвідФайлу
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиАудіо.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    audio=я.аудіо,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    duration=я.тривалість,
    performer=я.виконавець,
    title=я.назва,
    thumb=я.мініатюра,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиДокумент
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  документ ВвідФайлу
  мініатюра ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  вимкнути_визначення_типу_контенту логічне
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиДокумент.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    document=я.документ,
    thumb=я.мініатюра,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    disable_content_type_detection=я.вимкнути_визначення_типу_контенту,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиВідео
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  відео ВвідФайлу
  тривалість число
  ширина число
  висота число
  мініатюра ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  має_спойлер логічне
  підтримує_стрімінг логічне
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиВідео.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    video=я.відео,
    duration=я.тривалість,
    width=я.ширина,
    height=я.висота,
    thumb=я.мініатюра,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    has_spoiler=я.має_спойлер,
    supports_streaming=я.підтримує_стрімінг,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиАнімацію
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  анімація ВвідФайлу
  тривалість число
  ширина число
  висота число
  мініатюра ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  має_спойлер логічне
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиАнімацію.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    animation=я.анімація,
    duration=я.тривалість,
    width=я.ширина,
    height=я.висота,
    thumb=я.мініатюра,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    has_spoiler=я.має_спойлер,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиГолосовеПовідомлення
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  голос ВвідФайлу
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  тривалість число
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиГолосовеПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    voice=я.голос,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    duration=я.тривалість,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиВідеоповідомлення
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  відео_замітка ВвідФайлу
  тривалість число
  довжина число
  мініатюра ВвідФайлу
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиВідеоповідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    video_note=я.відео_замітка,
    duration=я.тривалість,
    length=я.довжина,
    thumb=я.мініатюра,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиМедіаГрупу
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  медіа Список
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
кінець

дія НадіслатиМедіаГрупу.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    media=я.медіа,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиЛокацію
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  широта число
  довгота число
  горизонтальна_точність число
  активний_період число
  напрямок число
  радіус_сповіщення число
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиЛокацію.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    latitude=я.широта,
    longitude=я.довгота,
    horizontal_accuracy=я.горизонтальна_точність,
    live_period=я.активний_період,
    heading=я.напрямок,
    proximity_alert_radius=я.радіус_сповіщення,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РедагуватиЖивуЛокаціюПовідомлення
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  ідентифікатор_інлайн_повідомлення текст
  широта число
  довгота число
  горизонтальна_точність число
  напрямок число
  радіус_сповіщення число
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія РедагуватиЖивуЛокаціюПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    latitude=я.широта,
    longitude=я.довгота,
    horizontal_accuracy=я.горизонтальна_точність,
    heading=я.напрямок,
    proximity_alert_radius=я.радіус_сповіщення,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗупинитиЖивуЛокаціюПовідомлення
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  ідентифікатор_інлайн_повідомлення текст
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія ЗупинитиЖивуЛокаціюПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиМісцеЗустрічі
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  широта число
  довгота число
  назва текст
  адреса текст
  ідентифікатор_Foursquare текст
  тип_Foursquare текст
  ідентифікатор_Google текст
  тип_Google текст
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиМісцеЗустрічі.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    latitude=я.широта,
    longitude=я.довгота,
    title=я.назва,
    address=я.адреса,
    foursquare_id=я.ідентифікатор_Foursquare,
    foursquare_type=я.тип_Foursquare,
    google_place_id=я.ідентифікатор_Google,
    google_place_type=я.тип_Google,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиКонтакт
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  номер_телефону текст
  ім'я текст
  прізвище текст
  візитна_картка текст
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиКонтакт.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    phone_number=я.номер_телефону,
    first_name=я.ім'я,
    last_name=я.прізвище,
    vcard=я.візитна_картка,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиОпитування
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  питання текст
  варіанти_відповідей Список
  анонімне_опитування логічне
  тип текст
  дозволені_множинні_відповіді логічне
  ідентифікатор_правильної_відповіді число
  пояснення текст
  режим_розбору_пояснення текст
  сутності_пояснення Список
  відкритий_період число
  дата_закриття число
  опитування_закрите логічне
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиОпитування.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    question=я.питання,
    options=я.варіанти_відповідей,
    is_anonymous=я.анонімне_опитування,
    type=я.тип,
    allows_multiple_answers=я.дозволені_множинні_відповіді,
    correct_option_id=я.ідентифікатор_правильної_відповіді,
    explanation=я.пояснення,
    explanation_parse_mode=я.режим_розбору_пояснення,
    explanation_entities=я.сутності_пояснення,
    open_period=я.відкритий_період,
    close_date=я.дата_закриття,
    is_closed=я.опитування_закрите,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиКубик
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  емодзі текст
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиКубик.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    emoji=я.емодзі,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиДіюЧату
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  операція текст
кінець

дія НадіслатиДіюЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    action=я.операція,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиФотографіїПрофілюКористувача
  ідентифікатор_користувача число
  зсув число
  ліміт число
кінець

дія ОтриматиФотографіїПрофілюКористувача.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    user_id=я.ідентифікатор_користувача,
    offset=я.зсув,
    limit=я.ліміт,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиФайл
  ідентифікатор_файлу текст
кінець

дія ОтриматиФайл.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    file_id=я.ідентифікатор_файлу,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗаблокуватиУчасникаЧату
  ідентифікатор_чату число
  ідентифікатор_користувача число
  до_дати число
  відкликати_повідомлення логічне
кінець

дія ЗаблокуватиУчасникаЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    user_id=я.ідентифікатор_користувача,
    until_date=я.до_дати,
    revoke_messages=я.відкликати_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РозблокуватиУчасникаЧату
  ідентифікатор_чату число
  ідентифікатор_користувача число
  тільки_якщо_забанено логічне
кінець

дія РозблокуватиУчасникаЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    user_id=я.ідентифікатор_користувача,
    only_if_banned=я.тільки_якщо_забанено,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура restrictChatMember
  ідентифікатор_чату число
  ідентифікатор_користувача число
  дозволи ДозволиЧату
  використовувати_незалежні_права_чату логічне
  до_дати число
кінець

дія restrictChatMember.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    user_id=я.ідентифікатор_користувача,
    permissions=я.дозволи,
    use_independent_chat_permissions=я.використовувати_незалежні_права_чату,
    until_date=я.до_дати,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура promoteChatMember
  ідентифікатор_чату число
  ідентифікатор_користувача число
  анонімне_опитування логічне
  може_керувати_чатом логічне
  може_публікувати_повідомлення логічне
  може_редагувати_повідомлення логічне
  може_видаляти_повідомлення логічне
  може_керувати_відеоконференціями логічне
  може_обмежувати_учасників логічне
  може_підвищувати_учасників логічне
  може_змінювати_інформацію логічне
  може_запрошувати_користувачів логічне
  може_закріплювати_повідомлення логічне
  може_керувати_темами логічне
кінець

дія promoteChatMember.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    user_id=я.ідентифікатор_користувача,
    is_anonymous=я.анонімне_опитування,
    can_manage_chat=я.може_керувати_чатом,
    can_post_messages=я.може_публікувати_повідомлення,
    can_edit_messages=я.може_редагувати_повідомлення,
    can_delete_messages=я.може_видаляти_повідомлення,
    can_manage_video_chats=я.може_керувати_відеоконференціями,
    can_restrict_members=я.може_обмежувати_учасників,
    can_promote_members=я.може_підвищувати_учасників,
    can_change_info=я.може_змінювати_інформацію,
    can_invite_users=я.може_запрошувати_користувачів,
    can_pin_messages=я.може_закріплювати_повідомлення,
    can_manage_topics=я.може_керувати_темами,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура setChatAdministratorCustomTitle
  ідентифікатор_чату число
  ідентифікатор_користувача число
  індивідуальний_заголовок текст
кінець

дія setChatAdministratorCustomTitle.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    user_id=я.ідентифікатор_користувача,
    custom_title=я.індивідуальний_заголовок,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура banChatSenderChat
  ідентифікатор_чату число
  ід_чату_відправника число
кінець

дія banChatSenderChat.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    sender_chat_id=я.ід_чату_відправника,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура unbanChatSenderChat
  ідентифікатор_чату число
  ід_чату_відправника число
кінець

дія unbanChatSenderChat.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    sender_chat_id=я.ід_чату_відправника,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиДозволиЧату
  ідентифікатор_чату число
  дозволи ДозволиЧату
  використовувати_незалежні_права_чату логічне
кінець

дія ВстановитиДозволиЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    permissions=я.дозволи,
    use_independent_chat_permissions=я.використовувати_незалежні_права_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЕкспортуватиПосиланняЗапрошенняЧату
  ідентифікатор_чату число
кінець

дія ЕкспортуватиПосиланняЗапрошенняЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура СтворитиПосиланняЗапрошенняЧату
  ідентифікатор_чату число
  назва текст
  дата_закінчення число
  ліміт_учасників число
  створює_запит_на_вступ логічне
кінець

дія СтворитиПосиланняЗапрошенняЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    name=я.назва,
    expire_date=я.дата_закінчення,
    member_limit=я.ліміт_учасників,
    creates_join_request=я.створює_запит_на_вступ,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РедагуватиПосиланняЗапрошенняЧату
  ідентифікатор_чату число
  посилання_запрошення текст
  назва текст
  дата_закінчення число
  ліміт_учасників число
  створює_запит_на_вступ логічне
кінець

дія РедагуватиПосиланняЗапрошенняЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    invite_link=я.посилання_запрошення,
    name=я.назва,
    expire_date=я.дата_закінчення,
    member_limit=я.ліміт_учасників,
    creates_join_request=я.створює_запит_на_вступ,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідкликатиПосиланняЗапрошенняЧату
  ідентифікатор_чату число
  посилання_запрошення текст
кінець

дія ВідкликатиПосиланняЗапрошенняЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    invite_link=я.посилання_запрошення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗатверджуватиЗапитНаВступДоЧату
  ідентифікатор_чату число
  ідентифікатор_користувача число
кінець

дія ЗатверджуватиЗапитНаВступДоЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    user_id=я.ідентифікатор_користувача,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідхилятиЗапитНаВступДоЧату
  ідентифікатор_чату число
  ідентифікатор_користувача число
кінець

дія ВідхилятиЗапитНаВступДоЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    user_id=я.ідентифікатор_користувача,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиФотоЧату
  ідентифікатор_чату число
  фото ВвідФайлу
кінець

дія ВстановитиФотоЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    photo=я.фото,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВидалитиФотоЧату
  ідентифікатор_чату число
кінець

дія ВидалитиФотоЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиНазвуЧату
  ідентифікатор_чату число
  назва текст
кінець

дія ВстановитиНазвуЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    title=я.назва,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиОписЧату
  ідентифікатор_чату число
  опис текст
кінець

дія ВстановитиОписЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    description=я.опис,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗакріпитиПовідомленняВЧаті
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  відключити_сповіщення логічне
кінець

дія ЗакріпитиПовідомленняВЧаті.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    disable_notification=я.відключити_сповіщення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідкріпитиПовідомленняВЧаті
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
кінець

дія ВідкріпитиПовідомленняВЧаті.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідкріпитиВсіПовідомленняВЧаті
  ідентифікатор_чату число
кінець

дія ВідкріпитиВсіПовідомленняВЧаті.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВийтиЗЧату
  ідентифікатор_чату число
кінець

дія ВийтиЗЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиІнформаціюПроЧат
  ідентифікатор_чату число
кінець

дія ОтриматиІнформаціюПроЧат.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиАдміністраторівЧату
  ідентифікатор_чату число
кінець

дія ОтриматиАдміністраторівЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиКількістьУчасниківЧату
  ідентифікатор_чату число
кінець

дія ОтриматиКількістьУчасниківЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиІнформаціюПроУчасникаЧату
  ідентифікатор_чату число
  ідентифікатор_користувача число
кінець

дія ОтриматиІнформаціюПроУчасникаЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    user_id=я.ідентифікатор_користувача,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиНабірСтікерівЧату
  ідентифікатор_чату число
  назва_набору_стікерів текст
кінець

дія ВстановитиНабірСтікерівЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    sticker_set_name=я.назва_набору_стікерів,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВидалитиНабірСтікерівЧату
  ідентифікатор_чату число
кінець

дія ВидалитиНабірСтікерівЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиСтікериІконокТемФоруму
кінець

дія ОтриматиСтікериІконокТемФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт()
кінець

;; ---

структура СтворитиТемуФоруму
  ідентифікатор_чату число
  назва текст
  колір_іконки число
  ідентифікатор_спеціальної_емоджі_іконки текст
кінець

дія СтворитиТемуФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    name=я.назва,
    icon_color=я.колір_іконки,
    icon_custom_emoji_id=я.ідентифікатор_спеціальної_емоджі_іконки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РедагуватиТемуФоруму
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  назва текст
  ідентифікатор_спеціальної_емоджі_іконки текст
кінець

дія РедагуватиТемуФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    name=я.назва,
    icon_custom_emoji_id=я.ідентифікатор_спеціальної_емоджі_іконки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗакритиТемуФоруму
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
кінець

дія ЗакритиТемуФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідкритиТемуФорумуЗнову
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
кінець

дія ВідкритиТемуФорумуЗнову.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВидалитиТемуФоруму
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
кінець

дія ВидалитиТемуФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідкріпитиВсіПовідомленняТемиФоруму
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
кінець

дія ВідкріпитиВсіПовідомленняТемиФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РедагуватиЗагальнуТемуФоруму
  ідентифікатор_чату число
  назва текст
кінець

дія РедагуватиЗагальнуТемуФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    name=я.назва,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗакритиЗагальнуТемуФоруму
  ідентифікатор_чату число
кінець

дія ЗакритиЗагальнуТемуФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідкритиЗагальнуТемуФоруму
  ідентифікатор_чату число
кінець

дія ВідкритиЗагальнуТемуФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура СховатиЗагальнуТемуФоруму
  ідентифікатор_чату число
кінець

дія СховатиЗагальнуТемуФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ПоказатиЗагальнуТемуФоруму
  ідентифікатор_чату число
кінець

дія ПоказатиЗагальнуТемуФоруму.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідповістиНаЗапитCallback
  ід_запиту_зворотного_виклику текст
  текст текст
  показати_сповіщення логічне
  урл текст
  час_кешування число
кінець

дія ВідповістиНаЗапитCallback.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    callback_query_id=я.ід_запиту_зворотного_виклику,
    text=я.текст,
    show_alert=я.показати_сповіщення,
    url=я.урл,
    cache_time=я.час_кешування,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиМоїКоманди
  команди Список
  діапазон ОбсягКомандБота
  код_мови текст
кінець

дія ВстановитиМоїКоманди.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    commands=я.команди,
    scope=я.діапазон,
    language_code=я.код_мови,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВидалитиМоїКоманди
  діапазон ОбсягКомандБота
  код_мови текст
кінець

дія ВидалитиМоїКоманди.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    scope=я.діапазон,
    language_code=я.код_мови,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиМоїКоманди
  діапазон ОбсягКомандБота
  код_мови текст
кінець

дія ОтриматиМоїКоманди.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    scope=я.діапазон,
    language_code=я.код_мови,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиКнопкуМенюЧату
  ідентифікатор_чату число
  кнопка_меню КнопкаМеню
кінець

дія ВстановитиКнопкуМенюЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    menu_button=я.кнопка_меню,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиКнопкуМенюЧату
  ідентифікатор_чату число
кінець

дія ОтриматиКнопкуМенюЧату.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиМоїПраваАдміністратора
  права ПраваАдміністратораЧату
  для_каналів логічне
кінець

дія ВстановитиМоїПраваАдміністратора.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    rights=я.права,
    for_channels=я.для_каналів,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиМоїПраваАдміністратора
  для_каналів логічне
кінець

дія ОтриматиМоїПраваАдміністратора.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    for_channels=я.для_каналів,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РедагуватиТекстПовідомлення
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  ідентифікатор_інлайн_повідомлення текст
  текст текст
  режим_розбору текст
  сутності Список
  вимкнути_попередній_перегляд_сторінки логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія РедагуватиТекстПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    text=я.текст,
    parse_mode=я.режим_розбору,
    entities=я.сутності,
    disable_web_page_preview=я.вимкнути_попередній_перегляд_сторінки,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РедагуватиПідписПовідомлення
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  ідентифікатор_інлайн_повідомлення текст
  підпис текст
  режим_розбору текст
  сутності_підпису Список
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія РедагуватиПідписПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    caption=я.підпис,
    parse_mode=я.режим_розбору,
    caption_entities=я.сутності_підпису,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РедагуватиМедіаПовідомлення
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  ідентифікатор_інлайн_повідомлення текст
  медіа ВвідМедіа
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія РедагуватиМедіаПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    media=я.медіа,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура РедагуватиРозміткуВідповідіПовідомлення
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  ідентифікатор_інлайн_повідомлення текст
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія РедагуватиРозміткуВідповідіПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗупинитиОпитування
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія ЗупинитиОпитування.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВидалитиПовідомлення
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
кінець

дія ВидалитиПовідомлення.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиСтікер
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  стікер ВвідФайлу
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиСтікер.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    sticker=я.стікер,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиНабірСтікерів
  назва текст
кінець

дія ОтриматиНабірСтікерів.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    name=я.назва,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиСтікериСпеціальногоЕмодзі
  ід_власних_емодзі Список
кінець

дія ОтриматиСтікериСпеціальногоЕмодзі.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    custom_emoji_ids=я.ід_власних_емодзі,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ЗавантажитиФайлСтікера
  ідентифікатор_користувача число
  png_стікер ВвідФайлу
кінець

дія ЗавантажитиФайлСтікера.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    user_id=я.ідентифікатор_користувача,
    png_sticker=я.png_стікер,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура СтворитиНовийНабірСтікерів
  ідентифікатор_користувача число
  назва текст
  назва текст
  png_стікер ВвідФайлу
  tgs_стікер ВвідФайлу
  webm_стікер ВвідФайлу
  тип_стікера текст
  емодзі текст
  позиція_маски ПозиціяМаски
кінець

дія СтворитиНовийНабірСтікерів.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    user_id=я.ідентифікатор_користувача,
    name=я.назва,
    title=я.назва,
    png_sticker=я.png_стікер,
    tgs_sticker=я.tgs_стікер,
    webm_sticker=я.webm_стікер,
    sticker_type=я.тип_стікера,
    emojis=я.емодзі,
    mask_position=я.позиція_маски,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ДодатиСтікерДоНабору
  ідентифікатор_користувача число
  назва текст
  png_стікер ВвідФайлу
  tgs_стікер ВвідФайлу
  webm_стікер ВвідФайлу
  емодзі текст
  позиція_маски ПозиціяМаски
кінець

дія ДодатиСтікерДоНабору.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    user_id=я.ідентифікатор_користувача,
    name=я.назва,
    png_sticker=я.png_стікер,
    tgs_sticker=я.tgs_стікер,
    webm_sticker=я.webm_стікер,
    emojis=я.емодзі,
    mask_position=я.позиція_маски,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиПозиціюСтікераВНаборі
  стікер текст
  позиція число
кінець

дія ВстановитиПозиціюСтікераВНаборі.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    sticker=я.стікер,
    position=я.позиція,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВидалитиСтікерЗНабору
  стікер текст
кінець

дія ВидалитиСтікерЗНабору.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    sticker=я.стікер,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиЕскізНаборуСтікерів
  назва текст
  ідентифікатор_користувача число
  мініатюра ВвідФайлу
кінець

дія ВстановитиЕскізНаборуСтікерів.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    name=я.назва,
    user_id=я.ідентифікатор_користувача,
    thumb=я.мініатюра,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідповістиНаInlineЗапит
  ід_вбудованого_запиту текст
  результати Список
  час_кешування число
  особистий логічне
  наступний_зсув текст
  текст_перемикача_повідомлення текст
  параметр_перемикача_повідомлення текст
кінець

дія ВідповістиНаInlineЗапит.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    inline_query_id=я.ід_вбудованого_запиту,
    results=я.результати,
    cache_time=я.час_кешування,
    is_personal=я.особистий,
    next_offset=я.наступний_зсув,
    switch_pm_text=я.текст_перемикача_повідомлення,
    switch_pm_parameter=я.параметр_перемикача_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідповістиНаЗапитWebApp
  ід_запиту_веб_додатка текст
  результат РезультатВбудованогоЗапиту
кінець

дія ВідповістиНаЗапитWebApp.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    web_app_query_id=я.ід_запиту_веб_додатка,
    result=я.результат,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиРахунок
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  назва текст
  опис текст
  підзаголовок текст
  токен_провайдера текст
  валюта текст
  ціни Список
  максимальна_сума_чайових число
  рекомендовані_суми_чайових Список
  початковий_параметр текст
  дані_провайдера текст
  посилання_на_фото текст
  розмір_фото число
  ширина_фото число
  висота_фото число
  потрібне_ім'я логічне
  потрібен_номер_телефону логічне
  потрібна_електронна_адреса логічне
  потрібна_адреса_доставки логічне
  надіслати_номер_телефону_провайдеру логічне
  надіслати_електронну_адресу_провайдеру логічне
  гнучкість логічне
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиРахунок.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    title=я.назва,
    description=я.опис,
    payload=я.підзаголовок,
    provider_token=я.токен_провайдера,
    currency=я.валюта,
    prices=я.ціни,
    max_tip_amount=я.максимальна_сума_чайових,
    suggested_tip_amounts=я.рекомендовані_суми_чайових,
    start_parameter=я.початковий_параметр,
    provider_data=я.дані_провайдера,
    photo_url=я.посилання_на_фото,
    photo_size=я.розмір_фото,
    photo_width=я.ширина_фото,
    photo_height=я.висота_фото,
    need_name=я.потрібне_ім'я,
    need_phone_number=я.потрібен_номер_телефону,
    need_email=я.потрібна_електронна_адреса,
    need_shipping_address=я.потрібна_адреса_доставки,
    send_phone_number_to_provider=я.надіслати_номер_телефону_провайдеру,
    send_email_to_provider=я.надіслати_електронну_адресу_провайдеру,
    is_flexible=я.гнучкість,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура СтворитиПосиланняРахунку
  назва текст
  опис текст
  підзаголовок текст
  токен_провайдера текст
  валюта текст
  ціни Список
  максимальна_сума_чайових число
  рекомендовані_суми_чайових Список
  дані_провайдера текст
  посилання_на_фото текст
  розмір_фото число
  ширина_фото число
  висота_фото число
  потрібне_ім'я логічне
  потрібен_номер_телефону логічне
  потрібна_електронна_адреса логічне
  потрібна_адреса_доставки логічне
  надіслати_номер_телефону_провайдеру логічне
  надіслати_електронну_адресу_провайдеру логічне
  гнучкість логічне
кінець

дія СтворитиПосиланняРахунку.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    title=я.назва,
    description=я.опис,
    payload=я.підзаголовок,
    provider_token=я.токен_провайдера,
    currency=я.валюта,
    prices=я.ціни,
    max_tip_amount=я.максимальна_сума_чайових,
    suggested_tip_amounts=я.рекомендовані_суми_чайових,
    provider_data=я.дані_провайдера,
    photo_url=я.посилання_на_фото,
    photo_size=я.розмір_фото,
    photo_width=я.ширина_фото,
    photo_height=я.висота_фото,
    need_name=я.потрібне_ім'я,
    need_phone_number=я.потрібен_номер_телефону,
    need_email=я.потрібна_електронна_адреса,
    need_shipping_address=я.потрібна_адреса_доставки,
    send_phone_number_to_provider=я.надіслати_номер_телефону_провайдеру,
    send_email_to_provider=я.надіслати_електронну_адресу_провайдеру,
    is_flexible=я.гнучкість,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідповістиНаЗапитДоставки
  ід_запиту_доставки текст
  ок логічне
  варіанти_доставки Список
  повідомлення_про_помилку текст
кінець

дія ВідповістиНаЗапитДоставки.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    shipping_query_id=я.ід_запиту_доставки,
    ok=я.ок,
    shipping_options=я.варіанти_доставки,
    error_message=я.повідомлення_про_помилку,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВідповістиНаПеревіркаРозрахунку
  ід_запиту_попереднього_розрахунку текст
  ок логічне
  повідомлення_про_помилку текст
кінець

дія ВідповістиНаПеревіркаРозрахунку.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    pre_checkout_query_id=я.ід_запиту_попереднього_розрахунку,
    ok=я.ок,
    error_message=я.повідомлення_про_помилку,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиПомилкиДанихПаспорту
  ідентифікатор_користувача число
  помилки Список
кінець

дія ВстановитиПомилкиДанихПаспорту.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    user_id=я.ідентифікатор_користувача,
    errors=я.помилки,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура НадіслатиГру
  ідентифікатор_чату число
  ідентифікатор_теми_повідомлення число
  коротке_ім'я_гри текст
  відключити_сповіщення логічне
  захист_вмісту логічне
  відповісти_на_повідомлення_ід число
  дозволити_відправку_без_відповіді логічне
  розмітка_відповіді РозміткаІнлайнКлавіатури
кінець

дія НадіслатиГру.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    chat_id=я.ідентифікатор_чату,
    message_thread_id=я.ідентифікатор_теми_повідомлення,
    game_short_name=я.коротке_ім'я_гри,
    disable_notification=я.відключити_сповіщення,
    protect_content=я.захист_вмісту,
    reply_to_message_id=я.відповісти_на_повідомлення_ід,
    allow_sending_without_reply=я.дозволити_відправку_без_відповіді,
    reply_markup=я.розмітка_відповіді,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ВстановитиОчкиГри
  ідентифікатор_користувача число
  оцінка число
  примусити логічне
  вимкнути_редагування_повідомлення логічне
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  ідентифікатор_інлайн_повідомлення текст
кінець

дія ВстановитиОчкиГри.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    user_id=я.ідентифікатор_користувача,
    score=я.оцінка,
    force=я.примусити,
    disable_edit_message=я.вимкнути_редагування_повідомлення,
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець

;; ---

структура ОтриматиРекордиГри
  ідентифікатор_користувача число
  ідентифікатор_чату число
  ідентифікатор_повідомлення число
  ідентифікатор_інлайн_повідомлення текст
кінець

дія ОтриматиРекордиГри.перетворити_на_телеграм_об'єкт()
  Об'єкт(
    user_id=я.ідентифікатор_користувача,
    chat_id=я.ідентифікатор_чату,
    message_id=я.ідентифікатор_повідомлення,
    inline_message_id=я.ідентифікатор_інлайн_повідомлення,
    __оминати_пустоту_конвертуючи__=так
  )
кінець
`;

await mavka.eval(`
модуль ТелеграмБот
  модуль Типи
    ${typesModuleCode}

    дати Оновлення
    дати Повідомлення
  кінець
  
  модуль Методи
    ${methodsModuleCode}

    дати НадіслатиПовідомлення
  кінець

  структура Бот
    токен текст
    останнє_оновлення Типи.Оновлення або пусто
  кінець

  тривала дія Бот.запустити(слухач Дія)
    поки так
      якщо я.останнє_оновлення
        чекати список_оновлень = телеграм_бот_отримати_список_оновлень(я.токен, я.останнє_оновлення.ідентифікатор_оновлення)
      інакше
        чекати список_оновлень = телеграм_бот_отримати_список_оновлень(я.токен, 0)
      кінець

      перебрати список_оновлень як оновлення
        оновлення = Типи.Оновлення.створити_з_телеграм_об'єкта(оновлення)
        чекати слухач(оновлення)
        я.останнє_оновлення = оновлення
      кінець
    кінець 
  кінець
  
  дія Бот.надіслати_повідомлення(нп Методи.НадіслатиПовідомлення)
    телеграм_бот_надіслати_запит(я.токен, "sendMessage", нп.перетворити_на_телеграм_об'єкт())
  кінець
  
  дати Бот
  дати Типи
  дати Методи
кінець
`, context);
